fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <name>CMDTYPE</name>
                    <description>Command Type Register</description>
                    <addressOffset>0x1104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CMDTYPE_COMMAND</name>
                            <description>Command type</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CMDTYPE_COMMAND_NOOP</name>
                                    <description>NOOP</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDTYPE_COMMAND_PROGRAM</name>
                                    <description>PROGRAM</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDTYPE_COMMAND_ERASE</name>
                                    <description>ERASE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDTYPE_COMMAND_READVERIFY</name>
                                    <description>READVERIFY</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDTYPE_COMMAND_MODECHANGE</name>
                                    <description>MODECHANGE</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDTYPE_COMMAND_CLEARSTATUS</name>
                                    <description>CLEARSTATUS</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDTYPE_COMMAND_BLANKVERIFY</name>
                                    <description>BLANKVERIFY</description>
                                    <value>6</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMDTYPE_SIZE</name>
                            <description>Command size</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CMDTYPE_SIZE_ONEWORD</name>
                                    <description>ONEWORD</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDTYPE_SIZE_TWOWORD</name>
                                    <description>TWOWORD</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDTYPE_SIZE_FOURWORD</name>
                                    <description>FOURWORD</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDTYPE_SIZE_EIGHTWORD</name>
                                    <description>EIGHTWORD</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDTYPE_SIZE_SECTOR</name>
                                    <description>SECTOR</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDTYPE_SIZE_BANK</name>
                                    <description>BANK</description>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMDTYPE_RESERVED_3</name>
                            <description>Reserved</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMDTYPE_RESERVED_31_7</name>
                            <description>Reserved</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x19</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDCTL</name>
                    <description>Command Control Register</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CMDCTL_MODESEL</name>
                            <description>Mode
This field is only used for the Mode Change command type.  Otherwise, bank
and pump modes are set automaticlly through the NW hardware.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CMDCTL_MODESEL_READ</name>
                                    <description>READ</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDCTL_MODESEL_RDMARG0</name>
                                    <description>RDMARG0</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDCTL_MODESEL_RDMARG1</name>
                                    <description>RDMARG1</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDCTL_MODESEL_RDMARG0B</name>
                                    <description>RDMARG0B</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDCTL_MODESEL_RDMARG1B</name>
                                    <description>RDMARG1B</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDCTL_MODESEL_PGMVER</name>
                                    <description>PGMVER</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDCTL_MODESEL_PGMSW</name>
                                    <description>PGMSW</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDCTL_MODESEL_ERASEVER</name>
                                    <description>ERASEVER</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDCTL_MODESEL_ERASESECT</name>
                                    <description>ERASESECT</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDCTL_MODESEL_PGMMW</name>
                                    <description>PGMMW</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDCTL_MODESEL_ERASEBNK</name>
                                    <description>ERASEBNK</description>
                                    <value>15</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMDCTL_REGIONSEL</name>
                            <description>Bank Region
A specific region ID can be written to this field to indicate to which region an 
operation is to be applied if CMDCTL.ADDRXLATEOVR is set.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CMDCTL_REGIONSEL_MAIN</name>
                                    <description>MAIN</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDCTL_REGIONSEL_NONMAIN</name>
                                    <description>NONMAIN</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDCTL_REGIONSEL_TRIM</name>
                                    <description>TRIM</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDCTL_REGIONSEL_ENGR</name>
                                    <description>ENGR</description>
                                    <value>8</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMDCTL_ADDRXLATEOVR</name>
                            <description>Override hardware address translation of address in CMDADDR from a 
system address to a bank address and bank ID.  Use data written to 
CMDADDR directly as the bank address.  Use the value written to 
CMDCTL.BANKSEL directly as the bank ID.  Use the value written to
CMDCTL.REGIONSEL directly as the region ID.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CMDCTL_ADDRXLATEOVR_NOOVERRIDE</name>
                                    <description>NOOVERRIDE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDCTL_ADDRXLATEOVR_OVERRIDE</name>
                                    <description>OVERRIDE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMDCTL_SSERASEDIS</name>
                            <description>Disable Stair-Step Erase.  If set, the default VHV trim voltage setting will be used
for all erase pulses.
By default, this bit is reset, meaning that the VHV voltage will be stepped during
successive erase pulses.  The step count, step voltage, begin and end voltages
are all hard-wired.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CMDCTL_SSERASEDIS_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDCTL_SSERASEDIS_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMDCTL_DATAVEREN</name>
                            <description>Enable invalid data verify.  
This checks for 0-&amp;gt;1 transitions in the memory when
a program operation is initiated.  If such a transition is found, the program will
fail with an error without executing the program.</description>
                            <bitOffset>0x15</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CMDCTL_DATAVEREN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CMDCTL_DATAVEREN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMDCTL_RESERVED_13</name>
                            <description>Reserved</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMDCTL_RESERVED_31_22</name>
                            <description>Reserved</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0xA</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDADDR</name>
                    <description>Command Address Register</description>
                    <addressOffset>0x1120</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CMDADDR_VAL</name>
                            <description>Address value</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x20</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDBYTEN</name>
                    <description>Command Program Byte Enable Register</description>
                    <addressOffset>0x1124</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CMDBYTEN_VAL</name>
                            <description>Command Byte Enable value.
A 1-bit per flash word byte value is placed in this register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMDBYTEN_RESERVED_31_18</name>
                            <description>Reserved</description>
                            <bitOffset>0x12</bitOffset>
                            <bitWidth>0xE</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDDATA0</name>
                    <description>Command Data Register 0</description>
                    <addressOffset>0x1130</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CMDDATA0_VAL</name>
                            <description>A 32-bit data value is placed in this field.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x20</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDDATA1</name>
                    <description>Command Data Register 1</description>
                    <addressOffset>0x1134</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CMDDATA1_VAL</name>
                            <description>A 32-bit data value is placed in this field.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x20</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDWEPROTA</name>
                    <description>Command Write Erase Protect A Register</description>
                    <addressOffset>0x11D0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CMDWEPROTA_VAL</name>
                            <description>Each bit protects 1 sector.

bit [0]:	When 1, sector 0 of the flash memory will be protected from program
		and erase.
bit [1]:	When 1, sector 1 of the flash memory will be protected from program
		and erase.
	:
	:
bit [31]:	When 1, sector 31 of the flash memory will be protected from program
		and erase.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x20</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDWEPROTB</name>
                    <description>Command Write Erase Protect B Register</description>
                    <addressOffset>0x11D4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CMDWEPROTB_VAL</name>
                            <description>Each bit protects a group of 8 sectors.  When a bit is 1, the associated 8 sectors
in the flash will be protected from program and erase.  A maximum of 256
sectors can be protected with this register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDWEPROTC</name>
                    <description>Command Write Erase Protect C Register</description>
                    <addressOffset>0x11D8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CMDWEPROTC_VAL</name>
                            <description>Each bit protects a group of 8 sectors.  When a bit is 1, the associated 8 sectors
in the flash will be protected from program and erase.  Note that the sectors
protected with this register start at sector 256 in the flash, where the sectors
protected by the CMDWEPROTB register end.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x0</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDWEPROTNM</name>
                    <description>Command Write Erase Protect Non-Main Register</description>
                    <addressOffset>0x1210</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CMDWEPROTNM_VAL</name>
                            <description>Each bit protects 1 sector.

bit [0]:	When 1, sector 0 of the non-main region will be protected from program
		and erase.
bit [1]:	When 1, sector 1 of the non-main region will be protected from program
		and erase.
	:
	:
bit [31]:	When 1, sector 31 of the non-main will be protected from program
		and erase.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
