fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <name>CMDWEPROTTR</name>
                    <description>Command Write Erase Protect Trim Register</description>
                    <addressOffset>0x1214</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CMDWEPROTTR_VAL</name>
                            <description>Each bit protects 1 sector.

bit [0]:	When 1, sector 0 of the engr region will be protected from program
		and erase.
bit [1]:	When 1, sector 1 of the engr region will be protected from program
		and erase.
	:
	:
bit [31]:	When 1, sector 31 of the engr region will be protected from program
		and erase.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDWEPROTEN</name>
                    <description>Command Write Erase Protect Engr Register</description>
                    <addressOffset>0x1218</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CMDWEPROTEN_VAL</name>
                            <description>Each bit protects 1 sector.

bit [0]:	When 1, sector 0 of the engr region will be protected from program
		and erase.
bit [1]:	When 1, sector 1 of the engr region will be protected from program
		and erase.
	:
	:
bit [31]:	When 1, sector 31 of the engr region will be protected from program
		and erase.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFGCMD</name>
                    <description>Command Configuration Register</description>
                    <addressOffset>0x13B0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CFGCMD_WAITSTATE</name>
                            <description>Wait State setting for program verify, erase verify and read verify</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFGCMD_RESERVED_31_7</name>
                            <description>Reserved</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x19</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFGPCNT</name>
                    <description>Pulse Counter Configuration Register</description>
                    <addressOffset>0x13B4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CFGPCNT_MAXPCNTOVR</name>
                            <description>Override hard-wired maximum pulse count.  If MAXERSPCNTOVR
is not set, then setting this value alone will override the max pulse count for
both program and erase.  If MAXERSPCNTOVR is set, then this bit will only
control the max pulse count setting for program.
By default, this bit is 0, and a hard-wired max pulse count is used.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CFGPCNT_MAXPCNTOVR_DEFAULT</name>
                                    <description>DEFAULT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CFGPCNT_MAXPCNTOVR_OVERRIDE</name>
                                    <description>OVERRIDE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CFGPCNT_MAXPCNTVAL</name>
                            <description>Override maximum pulse counter with this value.  
If MAXPCNTOVR = 0, then this field is ignored.
If MAXPCNTOVR = 1 and MAXERSPCNTOVR = 0, then this value will be used 
to override the max pulse count for both program and erase.  Full max value
will be {4'h0, MAXPCNTVAL} .
If MAXPCNTOVR = 1 and MAXERSPCNTOVR = 1, then this value will be used
to override the max pulse count for program only.  Full max value will be
{4'h0, MAXPCNTVAL}.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFGPCNT_RESERVED_15_12</name>
                            <description>Reserved</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFGPCNT_RESERVED_3_1</name>
                            <description>Reserved</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFGPCNT_RESERVED_17_19</name>
                            <description>Reserved</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STATCMD</name>
                    <description>Command Status Register</description>
                    <addressOffset>0x13D0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>STATCMD_CMDDONE</name>
                            <description>Command Done</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STATCMD_CMDDONE_STATNOTDONE</name>
                                    <description>STATNOTDONE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATCMD_CMDDONE_STATDONE</name>
                                    <description>STATDONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STATCMD_CMDPASS</name>
                            <description>Command Pass - valid when CMD_DONE field is 1</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STATCMD_CMDPASS_STATFAIL</name>
                                    <description>STATFAIL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATCMD_CMDPASS_STATPASS</name>
                                    <description>STATPASS</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STATCMD_CMDINPROGRESS</name>
                            <description>Command In Progress</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STATCMD_CMDINPROGRESS_STATCOMPLETE</name>
                                    <description>STATCOMPLETE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATCMD_CMDINPROGRESS_STATINPROGRESS</name>
                                    <description>STATINPROGRESS</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STATCMD_FAILWEPROT</name>
                            <description>Command failed due to Write/Erase Protect Sector Violation</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STATCMD_FAILWEPROT_STATNOFAIL</name>
                                    <description>STATNOFAIL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATCMD_FAILWEPROT_STATFAIL</name>
                                    <description>STATFAIL</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STATCMD_FAILVERIFY</name>
                            <description>Command failed due to verify error</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STATCMD_FAILVERIFY_STATNOFAIL</name>
                                    <description>STATNOFAIL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATCMD_FAILVERIFY_STATFAIL</name>
                                    <description>STATFAIL</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STATCMD_FAILMISC</name>
                            <description>Command failed due to error other than write/erase protect violation or verify
error.  This is an extra bit in case a new failure mechanism is added which
requires a status bit.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STATCMD_FAILMISC_STATNOFAIL</name>
                                    <description>STATNOFAIL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATCMD_FAILMISC_STATFAIL</name>
                                    <description>STATFAIL</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STATCMD_FAILILLADDR</name>
                            <description>Command failed due to the use of an illegal address</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STATCMD_FAILILLADDR_STATNOFAIL</name>
                                    <description>STATNOFAIL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATCMD_FAILILLADDR_STATFAIL</name>
                                    <description>STATFAIL</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STATCMD_FAILMODE</name>
                            <description>Command failed because a bank has been set to a mode other than READ.
Program and Erase commands cannot be initiated unless all banks are in READ
mode.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STATCMD_FAILMODE_STATNOFAIL</name>
                                    <description>STATNOFAIL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATCMD_FAILMODE_STATFAIL</name>
                                    <description>STATFAIL</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STATCMD_FAILINVDATA</name>
                            <description>Program command failed because an attempt was made to program a stored
0 value to a 1.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STATCMD_FAILINVDATA_STATNOFAIL</name>
                                    <description>STATNOFAIL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATCMD_FAILINVDATA_STATFAIL</name>
                                    <description>STATFAIL</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STATCMD_RESERVED_3</name>
                            <description>Reserved</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STATCMD_RESERVED_11_9</name>
                            <description>Reserved</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STATCMD_RESERVED_31_13</name>
                            <description>Reserved</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x13</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STATADDR</name>
                    <description>Address Status Register</description>
                    <addressOffset>0x13D4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>STATADDR_BANKADDR</name>
                            <description>Current Bank Address
A bank offset address is stored in this register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STATADDR_BANKID</name>
                            <description>Current Bank ID
A bank indicator is stored in this register which represents the current bank on
which the state  machine is operating.  There is 1 bit per bank.</description>
                            <bitOffset>0x15</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STATADDR_BANKID_BANK0</name>
                                    <description>BANK0</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATADDR_BANKID_BANK1</name>
                                    <description>BANK1</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATADDR_BANKID_BANK2</name>
                                    <description>BANK2</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATADDR_BANKID_BANK3</name>
                                    <description>BANK3</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATADDR_BANKID_BANK4</name>
                                    <description>BANK4</description>
                                    <value>16</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STATADDR_REGIONID</name>
                            <description>Current Region ID
A region indicator is stored in this register which represents the current flash 
region on which the state  machine is operating.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STATADDR_REGIONID_MAIN</name>
                                    <description>MAIN</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATADDR_REGIONID_NONMAIN</name>
                                    <description>NONMAIN</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATADDR_REGIONID_TRIM</name>
                                    <description>TRIM</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATADDR_REGIONID_ENGR</name>
                                    <description>ENGR</description>
                                    <value>8</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STATADDR_RESERVED_31_26</name>
                            <description>Reserved</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
