fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <name>STATPCNT</name>
                    <description>Pulse Count Status Register</description>
                    <addressOffset>0x13D8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>STATPCNT_PULSECNT</name>
                            <description>Current Pulse Counter Value</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0xC</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STATPCNT_RESERVED_31_12</name>
                            <description>Reserved</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x14</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STATMODE</name>
                    <description>Mode Status Register</description>
                    <addressOffset>0x13DC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>STATMODE_BANKNOTINRD</name>
                            <description>Bank not in read mode.
Indicates which banks are not in READ mode.  There is 1 bit per bank.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STATMODE_BANKNOTINRD_BANK0</name>
                                    <description>BANK0</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATMODE_BANKNOTINRD_BANK1</name>
                                    <description>BANK1</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATMODE_BANKNOTINRD_BANK2</name>
                                    <description>BANK2</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATMODE_BANKNOTINRD_BANK3</name>
                                    <description>BANK3</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATMODE_BANKNOTINRD_BANK4</name>
                                    <description>BANK4</description>
                                    <value>16</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STATMODE_BANKMODE</name>
                            <description>Indicates mode of bank(s) that are not in READ mode</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STATMODE_BANKMODE_READ</name>
                                    <description>READ</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATMODE_BANKMODE_RDMARG0</name>
                                    <description>RDMARG0</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATMODE_BANKMODE_RDMARG1</name>
                                    <description>RDMARG1</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATMODE_BANKMODE_RDMARG0B</name>
                                    <description>RDMARG0B</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATMODE_BANKMODE_RDMARG1B</name>
                                    <description>RDMARG1B</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATMODE_BANKMODE_PGMVER</name>
                                    <description>PGMVER</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATMODE_BANKMODE_PGMSW</name>
                                    <description>PGMSW</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATMODE_BANKMODE_ERASEVER</name>
                                    <description>ERASEVER</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATMODE_BANKMODE_ERASESECT</name>
                                    <description>ERASESECT</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATMODE_BANKMODE_PGMMW</name>
                                    <description>PGMMW</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATMODE_BANKMODE_ERASEBNK</name>
                                    <description>ERASEBNK</description>
                                    <value>15</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STATMODE_BANK2TRDY</name>
                            <description>Bank 2T Ready.
Bank(s) are ready for 2T access.  This is accomplished when the pump has
fully driven power rails to the bank(s).</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STATMODE_BANK2TRDY_FALSE</name>
                                    <description>FALSE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATMODE_BANK2TRDY_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STATMODE_BANK1TRDY</name>
                            <description>Bank 1T Ready.
Bank(s) are ready for 1T access.  This is accomplished when the bank and pump
have been trimmed.</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STATMODE_BANK1TRDY_FALSE</name>
                                    <description>FALSE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATMODE_BANK1TRDY_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STATMODE_RESERVED_31_18</name>
                            <description>Reserved</description>
                            <bitOffset>0x12</bitOffset>
                            <bitWidth>0xE</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STATMODE_RESERVED_7_5</name>
                            <description>Reserved</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STATMODE_RESERVED_15_12</name>
                            <description>Reserved</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GBLINFO0</name>
                    <description>Global Information Register 0</description>
                    <addressOffset>0x13F0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>GBLINFO0_SECTORSIZE</name>
                            <description>Sector size in bytes</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GBLINFO0_SECTORSIZE_ONEKB</name>
                                    <description>ONEKB</description>
                                    <value>1024</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>GBLINFO0_SECTORSIZE_TWOKB</name>
                                    <description>TWOKB</description>
                                    <value>2048</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GBLINFO0_NUMBANKS</name>
                            <description>Number of banks instantiated
Minimum:	1
Maximum:	5</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GBLINFO0_RESERVED_31_19</name>
                            <description>Reserved</description>
                            <bitOffset>0x13</bitOffset>
                            <bitWidth>0xD</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GBLINFO1</name>
                    <description>Global Information Register 1</description>
                    <addressOffset>0x13F4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>GBLINFO1_DATAWIDTH</name>
                            <description>Data width in bits</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GBLINFO1_DATAWIDTH_W64BIT</name>
                                    <description>W64BIT</description>
                                    <value>64</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>GBLINFO1_DATAWIDTH_W128BIT</name>
                                    <description>W128BIT</description>
                                    <value>128</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GBLINFO1_ECCWIDTH</name>
                            <description>ECC data width in bits</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GBLINFO1_ECCWIDTH_W0BIT</name>
                                    <description>W0BIT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>GBLINFO1_ECCWIDTH_W8BIT</name>
                                    <description>W8BIT</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>GBLINFO1_ECCWIDTH_W16BIT</name>
                                    <description>W16BIT</description>
                                    <value>16</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GBLINFO1_REDWIDTH</name>
                            <description>Redundant data width in bits</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GBLINFO1_REDWIDTH_W0BIT</name>
                                    <description>W0BIT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>GBLINFO1_REDWIDTH_W2BIT</name>
                                    <description>W2BIT</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>GBLINFO1_REDWIDTH_W4BIT</name>
                                    <description>W4BIT</description>
                                    <value>4</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GBLINFO1_RESERVED_31_19</name>
                            <description>Reserved</description>
                            <bitOffset>0x13</bitOffset>
                            <bitWidth>0xD</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GBLINFO1_RESERVED_15_13</name>
                            <description>Reserved</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GBLINFO2</name>
                    <description>Global Information Register 2</description>
                    <addressOffset>0x13F8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>GBLINFO2_DATAREGISTERS</name>
                            <description>Number of data registers present.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GBLINFO2_RESERVED_31_4</name>
                            <description>Reserved</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1C</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BANK0INFO0</name>
                    <description>Bank Information Register 0 for Bank 0</description>
                    <addressOffset>0x1400</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>BANK0INFO0_MAINSIZE</name>
                            <description>Main region size in sectors
Minimum:	0x8 (8)
Maximum:	0x200 (512)</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0xC</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BANK0INFO0_MAINSIZE_MINSECTORS</name>
                                    <description>MINSECTORS</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BANK0INFO0_MAINSIZE_MAXSECTORS</name>
                                    <description>MAXSECTORS</description>
                                    <value>512</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BANK0INFO0_RESERVED_31_12</name>
                            <description>Reserved</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x14</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
