fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <name>BANK0INFO1</name>
                    <description>Bank Information Register 1 for Bank 0</description>
                    <addressOffset>0x1404</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>BANK0INFO1_NONMAINSIZE</name>
                            <description>Non-main region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BANK0INFO1_NONMAINSIZE_MINSECTORS</name>
                                    <description>MINSECTORS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BANK0INFO1_NONMAINSIZE_MAXSECTORS</name>
                                    <description>MAXSECTORS</description>
                                    <value>32</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BANK0INFO1_TRIMSIZE</name>
                            <description>Trim region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BANK0INFO1_TRIMSIZE_MINSECTORS</name>
                                    <description>MINSECTORS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BANK0INFO1_TRIMSIZE_MAXSECTORS</name>
                                    <description>MAXSECTORS</description>
                                    <value>32</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BANK0INFO1_ENGRSIZE</name>
                            <description>Engr region size in sectors
Minimum:	0x0 (0)
Maximum:	0x10 (16)</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BANK0INFO1_ENGRSIZE_MINSECTORS</name>
                                    <description>MINSECTORS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BANK0INFO1_ENGRSIZE_MAXSECTORS</name>
                                    <description>MAXSECTORS</description>
                                    <value>32</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BANK0INFO1_RESERVED_31_24</name>
                            <description>Reserved</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>IOMUX</name>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x40428000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <dim>61</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60</dimArrayIndex>
                    <name>PINCM[%s]</name>
                    <description>Pin Control Management Register in SECCFG region</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x7f7fffff</resetMask>
                    <fields>
                        <field>
                            <name>PINCM_PF</name>
                            <description>Peripheral Function selection bits</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PINCM_PC</name>
                            <description>Peripheral is Connected</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_PC_UNCONNECTED</name>
                                    <description>UNCONNECTED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_PC_CONNECTED</name>
                                    <description>CONNECTED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_WAKESTAT</name>
                            <description>This has the IOPAD WAKEUP signal as status bit.</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_WAKESTAT_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_WAKESTAT_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_PIPD</name>
                            <description>Pull Down control selection</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_PIPD_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_PIPD_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_PIPU</name>
                            <description>Pull Up control selection</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_PIPU_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_PIPU_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_INENA</name>
                            <description>Input Enable Control Selection</description>
                            <bitOffset>0x12</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_INENA_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_INENA_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_HYSTEN</name>
                            <description>Hysteresis Enable Control Selection</description>
                            <bitOffset>0x13</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_HYSTEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_HYSTEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_DRV</name>
                            <description>Drive strength control selection, for HS IOCELL only</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_DRV_DRVVAL0</name>
                                    <description>DRVVAL0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_DRV_DRVVAL1</name>
                                    <description>DRVVAL1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_HIZ1</name>
                            <description>High output value will tri-state the output when this bit is enabled</description>
                            <bitOffset>0x19</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_HIZ1_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_HIZ1_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_WUEN</name>
                            <description>Wakeup Enable bit</description>
                            <bitOffset>0x1B</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_WUEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_WUEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_WCOMP</name>
                            <description>Wakeup Compare Value bit</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_WCOMP_MATCH0</name>
                                    <description>MATCH0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_WCOMP_MATCH1</name>
                                    <description>MATCH1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PINCM_INV</name>
                            <description>Data inversion selection</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PINCM_INV_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PINCM_INV_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
