fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <name>NMIRIS</name>
                    <description>NMI raw interrupt status</description>
                    <addressOffset>0x1060</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>NMIRIS_BORLVL</name>
                            <description>Raw status of the BORLVL NMI</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NMIRIS_BORLVL_FALSE</name>
                                    <description>FALSE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NMIRIS_BORLVL_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NMIRIS_WWDT0</name>
                            <description>Watch Dog 0 Fault</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NMIRIS_WWDT0_FALSE</name>
                                    <description>FALSE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NMIRIS_WWDT0_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NMIISET</name>
                    <description>NMI interrupt set</description>
                    <addressOffset>0x1070</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>NMIISET_BORLVL</name>
                            <description>Set the BORLVL NMI</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NMIISET_BORLVL_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NMIISET_BORLVL_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NMIISET_WWDT0</name>
                            <description>Watch Dog 0 Fault</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NMIISET_WWDT0_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NMIISET_WWDT0_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NMIICLR</name>
                    <description>NMI interrupt clear</description>
                    <addressOffset>0x1078</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>NMIICLR_BORLVL</name>
                            <description>Clr the BORLVL NMI</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NMIICLR_BORLVL_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NMIICLR_BORLVL_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NMIICLR_WWDT0</name>
                            <description>Watch Dog 0 Fault</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NMIICLR_WWDT0_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NMIICLR_WWDT0_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYSOSCCFG</name>
                    <description>SYSOSC configuration</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00020000</resetValue>
                    <resetMask>0x00030603</resetMask>
                    <fields>
                        <field>
                            <name>SYSOSCCFG_DISABLESTOP</name>
                            <description>DISABLESTOP sets the SYSOSC stop mode enable/disable policy.  When operating in STOP mode, the SYSOSC may be automatically disabled.  When set, ULPCLK will run from LFCLK in STOP mode and SYSOSC will be disabled to reduce power consumption.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SYSOSCCFG_DISABLESTOP_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SYSOSCCFG_DISABLESTOP_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SYSOSCCFG_BLOCKASYNCALL</name>
                            <description>BLOCKASYNCALL may be used to mask block all asynchronous fast clock requests, preventing hardware from dynamically changing the active clock configuration when operating in a given mode.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SYSOSCCFG_BLOCKASYNCALL_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SYSOSCCFG_BLOCKASYNCALL_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SYSOSCCFG_DISABLE</name>
                            <description>DISABLE sets the SYSOSC enable/disable policy.  SYSOSC may be powered off in RUN, SLEEP, and STOP modes to reduce power consumption.  When SYSOSC is disabled, MCLK and ULPCLK are sourced from LFCLK.</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SYSOSCCFG_DISABLE_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SYSOSCCFG_DISABLE_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SYSOSCCFG_FASTCPUEVENT</name>
                            <description>FASTCPUEVENT may be used to assert a fast clock request when an interrupt is asserted to the CPU, reducing interrupt latency.</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SYSOSCCFG_FASTCPUEVENT_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SYSOSCCFG_FASTCPUEVENT_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SYSOSCCFG_FREQ</name>
                            <description>Target operating frequency for the system oscillator (SYSOSC)</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SYSOSCCFG_FREQ_SYSOSCBASE</name>
                                    <description>SYSOSCBASE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SYSOSCCFG_FREQ_SYSOSC4M</name>
                                    <description>SYSOSC4M</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SYSOSCCFG_FREQ_SYSOSCUSER</name>
                                    <description>SYSOSCUSER</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HSCLKEN</name>
                    <description>High-speed clock (HSCLK) source enable/disable</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00010000</resetMask>
                    <fields>
                        <field>
                            <name>HSCLKEN_USEEXTHFCLK</name>
                            <description>USEEXTHFCLK selects the HFCLK_IN digital clock input to be the source for HFCLK.  When disabled, HFXT is the HFCLK source and HFXTEN may be set.  Do not set HFXTEN and USEEXTHFCLK simultaneously.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>HSCLKEN_USEEXTHFCLK_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSCLKEN_USEEXTHFCLK_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GENCLKEN</name>
                    <description>General clock enable control</description>
                    <addressOffset>0x113C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000011</resetMask>
                    <fields>
                        <field>
                            <name>GENCLKEN_EXCLKEN</name>
                            <description>EXCLKEN enables the CLK_OUT external clock output block.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GENCLKEN_EXCLKEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>GENCLKEN_EXCLKEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GENCLKEN_MFPCLKEN</name>
                            <description>MFPCLKEN enables the middle frequency precision clock (MFPCLK).</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GENCLKEN_MFPCLKEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>GENCLKEN_MFPCLKEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PMODECFG</name>
                    <description>Power mode configuration</description>
                    <addressOffset>0x1140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>PMODECFG_DSLEEP</name>
                            <description>DSLEEP selects the operating mode to enter upon a DEEPSLEEP request from the CPU.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PMODECFG_DSLEEP_STOP</name>
                                    <description>STOP</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PMODECFG_DSLEEP_STANDBY</name>
                                    <description>STANDBY</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PMODECFG_DSLEEP_SHUTDOWN</name>
                                    <description>SHUTDOWN</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCC</name>
                    <description>Frequency clock counter (FCC) count</description>
                    <addressOffset>0x1150</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fffff</resetMask>
                    <fields>
                        <field>
                            <name>FCC_DATA</name>
                            <description>Frequency clock counter (FCC) count value.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRAMBOUNDARY</name>
                    <description>SRAM Write Boundary</description>
                    <addressOffset>0x1178</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fffe0</resetMask>
                    <fields>
                        <field>
                            <name>SRAMBOUNDARY_ADDR</name>
                            <description>SRAM boundary configuration. The value configured into this acts such that: SRAM accesses to addresses less than or equal value will be RW only. SRAM accesses to addresses greater than value will be RX only. Value of 0 is not valid (system will have no stack). If set to 0, the system acts as if the entire SRAM is RWX.  Any non-zero value can be configured, including a value = SRAM size.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0xF</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
