fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <name>SYSTEMCFG</name>
                    <description>System configuration</description>
                    <addressOffset>0x1180</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>SYSTEMCFG_KEY</name>
                            <description>The key value of 1Bh (27) must be written to KEY together with contents to be updated. Reads as 0</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SYSTEMCFG_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>27</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SYSTEMCFG_WWDTLP0RSTDIS</name>
                            <description>WWDTLP0RSTDIS specifies whether a WWDT Error Event will trigger a BOOTRST or an NMI.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SYSTEMCFG_WWDTLP0RSTDIS_FALSE</name>
                                    <description>FALSE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SYSTEMCFG_WWDTLP0RSTDIS_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BEEPCFG</name>
                    <description>BEEPER Configuration</description>
                    <addressOffset>0x1190</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000031</resetMask>
                    <fields>
                        <field>
                            <name>BEEPCFG_FREQ</name>
                            <description>Beeper Output Frequency Configuration</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BEEPCFG_FREQ_8KHZ</name>
                                    <description>8KHZ</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BEEPCFG_FREQ_4KHZ</name>
                                    <description>4KHZ</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BEEPCFG_FREQ_2KHZ</name>
                                    <description>2KHZ</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BEEPCFG_FREQ_1KHZ</name>
                                    <description>1KHZ</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BEEPCFG_EN</name>
                            <description>Beeper Output Enable</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BEEPCFG_EN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BEEPCFG_EN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WRITELOCK</name>
                    <description>SYSCTL register write lockout</description>
                    <addressOffset>0x1200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>WRITELOCK_ACTIVE</name>
                            <description>ACTIVE controls whether critical SYSCTL registers are write protected or not.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>WRITELOCK_ACTIVE_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WRITELOCK_ACTIVE_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSTCAUSE</name>
                    <description>Reset cause</description>
                    <addressOffset>0x1220</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000001f</resetMask>
                    <fields>
                        <field>
                            <name>RSTCAUSE_ID</name>
                            <description>ID is a read-to-clear field which indicates the lowest level reset cause since the last read.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_NORST</name>
                                    <description>NORST</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_PORHWFAIL</name>
                                    <description>PORHWFAIL</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_POREXNRST</name>
                                    <description>POREXNRST</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_PORSW</name>
                                    <description>PORSW</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_BORSUPPLY</name>
                                    <description>BORSUPPLY</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_BORWAKESHUTDN</name>
                                    <description>BORWAKESHUTDN</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_BOOTNONPMUPARITY</name>
                                    <description>BOOTNONPMUPARITY</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_BOOTCLKFAIL</name>
                                    <description>BOOTCLKFAIL</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_BOOTEXNRST</name>
                                    <description>BOOTEXNRST</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_BOOTSW</name>
                                    <description>BOOTSW</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_SYSWWDT0</name>
                                    <description>SYSWWDT0</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_SYSBSLEXIT</name>
                                    <description>SYSBSLEXIT</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_SYSBSLENTRY</name>
                                    <description>SYSBSLENTRY</description>
                                    <value>17</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_SYSWWDT1</name>
                                    <description>SYSWWDT1</description>
                                    <value>19</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_SYSFLASHECC</name>
                                    <description>SYSFLASHECC</description>
                                    <value>20</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_SYSCPULOCK</name>
                                    <description>SYSCPULOCK</description>
                                    <value>21</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_SYSDBG</name>
                                    <description>SYSDBG</description>
                                    <value>26</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_SYSSW</name>
                                    <description>SYSSW</description>
                                    <value>27</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_CPUDBG</name>
                                    <description>CPUDBG</description>
                                    <value>28</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCAUSE_ID_CPUSW</name>
                                    <description>CPUSW</description>
                                    <value>29</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RESETLEVEL</name>
                    <description>Reset level for application-triggered reset command</description>
                    <addressOffset>0x1300</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>RESETLEVEL_LEVEL</name>
                            <description>LEVEL is used to specify the type of reset to be issued when RESETCMD is set to generate a software triggered reset.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RESETLEVEL_LEVEL_CPU</name>
                                    <description>CPU</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESETLEVEL_LEVEL_BOOT</name>
                                    <description>BOOT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESETLEVEL_LEVEL_BOOTLOADERENTRY</name>
                                    <description>BOOTLOADERENTRY</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESETLEVEL_LEVEL_POR</name>
                                    <description>POR</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESETLEVEL_LEVEL_BOOTLOADEREXIT</name>
                                    <description>BOOTLOADEREXIT</description>
                                    <value>4</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RESETCMD</name>
                    <description>Execute an application-triggered reset command</description>
                    <addressOffset>0x1304</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>RESETCMD_KEY</name>
                            <description>The key value of E4h (228) must be written to KEY together with GO to trigger the reset.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RESETCMD_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>228</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESETCMD_GO</name>
                            <description>Execute the reset specified in RESETLEVEL.LEVEL.  Must be written together with the KEY.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RESETCMD_GO_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BORTHRESHOLD</name>
                    <description>BOR threshold selection</description>
                    <addressOffset>0x1308</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>BORTHRESHOLD_LEVEL</name>
                            <description>LEVEL specifies the desired BOR threshold and BOR mode.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BORTHRESHOLD_LEVEL_BORMIN</name>
                                    <description>BORMIN</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BORTHRESHOLD_LEVEL_BORLEVEL1</name>
                                    <description>BORLEVEL1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BORTHRESHOLD_LEVEL_BORLEVEL2</name>
                                    <description>BORLEVEL2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BORTHRESHOLD_LEVEL_BORLEVEL3</name>
                                    <description>BORLEVEL3</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BORCLRCMD</name>
                    <description>Set the BOR threshold</description>
                    <addressOffset>0x130C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>BORCLRCMD_KEY</name>
                            <description>The key value of C7h (199) must be written to KEY together with GO to trigger the clear and BOR threshold change.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BORCLRCMD_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>199</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BORCLRCMD_GO</name>
                            <description>GO clears any prior BOR violation status indications and attempts to change the active BOR mode to that specified in the LEVEL field of the BORTHRESHOLD register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>BORCLRCMD_GO_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
