fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <name>SYSOSCFCLCTL</name>
                    <description>SYSOSC frequency correction loop (FCL) ROSC enable</description>
                    <addressOffset>0x1310</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>SYSOSCFCLCTL_KEY</name>
                            <description>The key value of 2Ah (42) must be written to KEY together with SETUSEFCL to enable the FCL.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SYSOSCFCLCTL_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>42</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SYSOSCFCLCTL_SETUSEFCL</name>
                            <description>Set SETUSEFCL to enable the frequency correction loop in SYSOSC.  Once enabled, this state is locked until the next BOOTRST.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SYSOSCFCLCTL_SETUSEFCL_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXLFCTL</name>
                    <description>LFCLK_IN and LFCLK control</description>
                    <addressOffset>0x1318</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>EXLFCTL_KEY</name>
                            <description>The key value of 36h (54) must be written to KEY together with SETUSEEXLF to set SETUSEEXLF.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EXLFCTL_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>54</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EXLFCTL_SETUSEEXLF</name>
                            <description>Set SETUSEEXLF to switch LFCLK to the LFCLK_IN digital clock input.  Once set, SETUSEEXLF remains set until the next BOOTRST.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EXLFCTL_SETUSEEXLF_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SHDNIOREL</name>
                    <description>SHUTDOWN IO release control</description>
                    <addressOffset>0x131C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>SHDNIOREL_KEY</name>
                            <description>The key value 91h must be written to KEY together with RELEASE to set RELEASE.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SHDNIOREL_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>145</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SHDNIOREL_RELEASE</name>
                            <description>Set RELEASE to release the IO after a SHUTDOWN mode exit.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SHDNIOREL_RELEASE_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXRSTPIN</name>
                    <description>Disable the reset function of the NRST pin</description>
                    <addressOffset>0x1320</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>EXRSTPIN_KEY</name>
                            <description>The key value 1Eh must be written together with DISABLE to disable the reset function.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EXRSTPIN_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>30</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EXRSTPIN_DISABLE</name>
                            <description>Set DISABLE to disable the reset function of the NRST pin.  Once set, this configuration is locked until the next POR.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EXRSTPIN_DISABLE_FALSE</name>
                                    <description>FALSE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EXRSTPIN_DISABLE_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SWDCFG</name>
                    <description>Disable the SWD function on the SWD pins</description>
                    <addressOffset>0x1328</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>SWDCFG_KEY</name>
                            <description>The key value 62h (98) must be written to KEY together with DISBALE to disable the SWD functions.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SWDCFG_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>98</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SWDCFG_DISABLE</name>
                            <description>Set DISABLE to disable the SWD function on SWD pins, allowing the SWD pins to be used as GPIO.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SWDCFG_DISABLE_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCCCMD</name>
                    <description>Frequency clock counter start capture</description>
                    <addressOffset>0x132C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>FCCCMD_KEY</name>
                            <description>The key value 0Eh (14) must be written with GO to start a capture.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FCCCMD_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>14</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FCCCMD_GO</name>
                            <description>Set GO to start a capture with the frequency clock counter (FCC).</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FCCCMD_GO_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SHUTDNSTORE0</name>
                    <description>Shutdown storage memory (byte 0)</description>
                    <addressOffset>0x1400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000003ff</resetMask>
                    <fields>
                        <field>
                            <name>SHUTDNSTORE0_DATA</name>
                            <description>Shutdown storage byte 0</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SHUTDNSTORE1</name>
                    <description>Shutdown storage memory (byte 1)</description>
                    <addressOffset>0x1404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000003ff</resetMask>
                    <fields>
                        <field>
                            <name>SHUTDNSTORE1_DATA</name>
                            <description>Shutdown storage byte 1</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SHUTDNSTORE2</name>
                    <description>Shutdown storage memory (byte 2)</description>
                    <addressOffset>0x1408</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000003ff</resetMask>
                    <fields>
                        <field>
                            <name>SHUTDNSTORE2_DATA</name>
                            <description>Shutdown storage byte 2</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SHUTDNSTORE3</name>
                    <description>Shutdown storage memory (byte 3)</description>
                    <addressOffset>0x140C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000003ff</resetMask>
                    <fields>
                        <field>
                            <name>SHUTDNSTORE3_DATA</name>
                            <description>Shutdown storage byte 3</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
