fullyautomated/mspm0-svd/svd/mspm0c110x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CRC</name>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x40440000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PWREN</name>
                    <description>Power enable</description>
                    <addressOffset>0x800</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PWREN_ENABLE</name>
                            <description>Enable the power</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PWREN_ENABLE_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PWREN_ENABLE_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PWREN_KEY</name>
                            <description>KEY to allow Power State Change</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PWREN_KEY_UNLOCK_W</name>
                                    <description>_TO_UNLOCK_W_</description>
                                    <value>38</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSTCTL</name>
                    <description>Reset Control</description>
                    <addressOffset>0x804</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RSTCTL_RESETSTKYCLR</name>
                            <description>Clear the RESETSTKY bit in the STAT register</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RSTCTL_RESETSTKYCLR_NOP</name>
                                    <description>NOP</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCTL_RESETSTKYCLR_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RSTCTL_RESETASSERT</name>
                            <description>Assert reset to the peripheral</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RSTCTL_RESETASSERT_NOP</name>
                                    <description>NOP</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCTL_RESETASSERT_ASSERT</name>
                                    <description>ASSERT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RSTCTL_KEY</name>
                            <description>Unlock key</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RSTCTL_KEY_UNLOCK_W</name>
                                    <description>_TO_UNLOCK_W_</description>
                                    <value>177</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RSTCTL_RESERVED1</name>
                            <description>Reserved</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x16</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STAT</name>
                    <description>Status Register</description>
                    <addressOffset>0x814</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>STAT_RESETSTKY</name>
                            <description>This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STAT_RESETSTKY_NORES</name>
                                    <description>NORES</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STAT_RESETSTKY_RESET</name>
                                    <description>RESET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STAT_RESERVED1</name>
                            <description>Reserved</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STAT_RESERVED2</name>
                            <description>Reserved</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0xF</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DESC</name>
                    <description>Module Description</description>
                    <addressOffset>0x10FC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>DESC_MINREV</name>
                            <description>Minor rev of the IP</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                        </field>
                        <field>
                            <name>DESC_MAJREV</name>
                            <description>Major rev of the IP</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x4</bitWidth>
                        </field>
                        <field>
                            <name>DESC_INSTNUM</name>
                            <description>Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                        </field>
                        <field>
                            <name>DESC_FEATUREVER</name>
                            <description>Feature Set for the module *instance*</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                        </field>
                        <field>
                            <name>DESC_MODULEID</name>
                            <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRCCTRL</name>
                    <description>CRC Control Register</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000017</resetMask>
                    <fields>
                        <field>
                            <name>CRCCTRL_BITREVERSE</name>
                            <description>CRC Bit Input and output Reverse. This bit indicates that the bit order of each input byte used for the CRC calculation is reversed before it is passed to the generator, and that the bit order of the calculated CRC is be reversed when read from CRC_RESULT.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CRCCTRL_BITREVERSE_NOT_REVERSED</name>
                                    <description>NOT_REVERSED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CRCCTRL_BITREVERSE_REVERSED</name>
                                    <description>REVERSED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CRCCTRL_INPUT_ENDIANNESS</name>
                            <description>CRC Endian. This bit indicates the byte order within a word or half word of input data.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CRCCTRL_INPUT_ENDIANNESS_LITTLE_ENDIAN</name>
                                    <description>LITTLE_ENDIAN</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CRCCTRL_INPUT_ENDIANNESS_BIG_ENDIAN</name>
                                    <description>BIG_ENDIAN</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CRCCTRL_OUTPUT_BYTESWAP</name>
                            <description>CRC Output Byteswap Enable. This bit controls whether the output is byte-swapped upon a read of the CRCOUT register.
If CRCOUT is accessed as a half-word, and the OUTPUT_BYTESWAP is set to to 1, then the two bytes in the 16-bit access are swapped and returned.
B1 is returned as B0
B0 is returned as B1

