fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <name>IIDX</name>
                    <description>Interrupt index</description>
                    <addressOffset>0x1020</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IIDX_STAT</name>
                            <description>UART Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in RIS and MIS registers. 15h-1Fh = Reserved</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IIDX_STAT_NO_INTR</name>
                                    <description>NO_INTR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_RTFG</name>
                                    <description>RTFG</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_FEFG</name>
                                    <description>FEFG</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_PEFG</name>
                                    <description>PEFG</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_BEFG</name>
                                    <description>BEFG</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_OEFG</name>
                                    <description>OEFG</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_RXNE</name>
                                    <description>RXNE</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_RXPE</name>
                                    <description>RXPE</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_LINC0</name>
                                    <description>LINC0</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_LINC1</name>
                                    <description>LINC1</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_LINOVF</name>
                                    <description>LINOVF</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_RXIFG</name>
                                    <description>RXIFG</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_TXIFG</name>
                                    <description>TXIFG</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_EOT</name>
                                    <description>EOT</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_MODE_9B</name>
                                    <description>MODE_9B</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_CTS</name>
                                    <description>CTS</description>
                                    <value>15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_DMA_DONE_RX</name>
                                    <description>DMA_DONE_RX</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_DMA_DONE_TX</name>
                                    <description>DMA_DONE_TX</description>
                                    <value>17</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_NERR_EVT</name>
                                    <description>NERR_EVT</description>
                                    <value>18</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
