fullyautomated/mspm0-svd/svd/mspm0c110x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>GPIOA</name>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x400A0000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1F00</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>FSUB_0</name>
                    <description>Subsciber Port 0</description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FSUB_0_CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FSUB_0_CHANID_UNCONNECTED</name>
                                    <description>UNCONNECTED</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSUB_1</name>
                    <description>Subscriber Port 1</description>
                    <addressOffset>0x404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FSUB_1_CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FSUB_1_CHANID_UNCONNECTED</name>
                                    <description>UNCONNECTED</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPUB_0</name>
                    <description>Publisher Port 0</description>
                    <addressOffset>0x444</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FPUB_0_CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FPUB_0_CHANID_UNCONNECTED</name>
                                    <description>UNCONNECTED</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPUB_1</name>
                    <description>Publisher Port 1</description>
                    <addressOffset>0x448</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FPUB_1_CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FPUB_1_CHANID_UNCONNECTED</name>
                                    <description>UNCONNECTED</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PWREN</name>
                    <description>Power enable</description>
                    <addressOffset>0x800</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PWREN_ENABLE</name>
                            <description>Enable the power</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PWREN_ENABLE_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PWREN_ENABLE_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PWREN_KEY</name>
                            <description>KEY to allow Power State Change</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PWREN_KEY_UNLOCK_W</name>
                                    <description>_TO_UNLOCK_W_</description>
                                    <value>38</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSTCTL</name>
                    <description>Reset Control</description>
                    <addressOffset>0x804</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <fields>
                        <field>
                            <name>RSTCTL_RESETSTKYCLR</name>
                            <description>Clear the RESETSTKY bit in the STAT register</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RSTCTL_RESETSTKYCLR_NOP</name>
                                    <description>NOP</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCTL_RESETSTKYCLR_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RSTCTL_RESETASSERT</name>
                            <description>Assert reset to the peripheral</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RSTCTL_RESETASSERT_NOP</name>
                                    <description>NOP</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCTL_RESETASSERT_ASSERT</name>
                                    <description>ASSERT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RSTCTL_KEY</name>
                            <description>Unlock key</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RSTCTL_KEY_UNLOCK_W</name>
                                    <description>_TO_UNLOCK_W_</description>
                                    <value>177</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STAT</name>
                    <description>Status Register</description>
                    <addressOffset>0x814</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>STAT_RESETSTKY</name>
                            <description>This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STAT_RESETSTKY_NORES</name>
                                    <description>NORES</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STAT_RESETSTKY_RESET</name>
                                    <description>RESET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKOVR</name>
                    <description>Clock Override</description>
                    <addressOffset>0x1010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLKOVR_OVERRIDE</name>
                            <description>Unlocks the functionality of [RUN_STOP] to override the automatic peripheral clock request</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKOVR_OVERRIDE_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKOVR_OVERRIDE_ENABLED</name>
                                    <description>ENABLED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLKOVR_RUN_STOP</name>
                            <description>If [OVERRIDE] is enabled, this register is used to manually control the peripheral's clock request to the system</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKOVR_RUN_STOP_RUN</name>
                                    <description>RUN</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKOVR_RUN_STOP_STOP</name>
                                    <description>STOP</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDBGCTL</name>
                    <description>Peripheral Debug Control</description>
                    <addressOffset>0x1018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>PDBGCTL_FREE</name>
                            <description>Free run control</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PDBGCTL_FREE_STOP</name>
                                    <description>STOP</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PDBGCTL_FREE_RUN</name>
                                    <description>RUN</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
