fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ISET_DIO23_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ISET_DIO24</name>
                            <description>DIO24 event</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ISET_DIO24_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ISET_DIO24_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ISET_DIO25</name>
                            <description>DIO25 event</description>
                            <bitOffset>0x19</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ISET_DIO25_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ISET_DIO25_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ISET_DIO26</name>
                            <description>DIO26 event</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ISET_DIO26_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ISET_DIO26_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ISET_DIO27</name>
                            <description>DIO27 event</description>
                            <bitOffset>0x1B</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ISET_DIO27_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ISET_DIO27_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ISET_DIO28</name>
                            <description>DIO28 event</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ISET_DIO28_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ISET_DIO28_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ISET_DIO29</name>
                            <description>DIO29 event</description>
                            <bitOffset>0x1D</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ISET_DIO29_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ISET_DIO29_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ISET_DIO30</name>
                            <description>DIO30 event</description>
                            <bitOffset>0x1E</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ISET_DIO30_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ISET_DIO30_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_ISET_DIO31</name>
                            <description>DIO31 event</description>
                            <bitOffset>0x1F</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ISET_DIO31_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_ISET_DIO31_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
