fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                            <description>This bit sets the value of the pin configured as DIO21 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x15</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO21_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO21_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT31_0_DIO22</name>
                            <description>This bit sets the value of the pin configured as DIO22 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO22_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO22_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT31_0_DIO23</name>
                            <description>This bit sets the value of the pin configured as DIO23 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x17</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO23_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO23_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT31_0_DIO24</name>
                            <description>This bit sets the value of the pin configured as DIO24 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO24_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO24_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT31_0_DIO25</name>
                            <description>This bit sets the value of the pin configured as DIO25 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x19</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO25_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO25_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT31_0_DIO26</name>
                            <description>This bit sets the value of the pin configured as DIO26 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO26_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO26_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT31_0_DIO27</name>
                            <description>This bit sets the value of the pin configured as DIO27 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x1B</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO27_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO27_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT31_0_DIO28</name>
                            <description>This bit sets the value of the pin configured as DIO28 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO28_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO28_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT31_0_DIO29</name>
                            <description>This bit sets the value of the pin configured as DIO29 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x1D</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO29_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO29_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT31_0_DIO30</name>
                            <description>This bit sets the value of the pin configured as DIO30 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x1E</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO30_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO30_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT31_0_DIO31</name>
                            <description>This bit sets the value of the pin configured as DIO31 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x1F</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO31_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT31_0_DIO31_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
