fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <name>POLARITY15_0</name>
                    <description>Polarity 15 to 0</description>
                    <addressOffset>0x1390</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>POLARITY15_0_DIO0</name>
                            <description>Enables and configures edge detection polarity for DIO0.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO0_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO0_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO0_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO0_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY15_0_DIO1</name>
                            <description>Enables and configures edge detection polarity for DIO1.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO1_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO1_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO1_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO1_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY15_0_DIO2</name>
                            <description>Enables and configures edge detection polarity for DIO2.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO2_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO2_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO2_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO2_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY15_0_DIO3</name>
                            <description>Enables and configures edge detection polarity for DIO3.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO3_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO3_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO3_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO3_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY15_0_DIO4</name>
                            <description>Enables and configures edge detection polarity for DIO4.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO4_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO4_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO4_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO4_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY15_0_DIO5</name>
                            <description>Enables and configures edge detection polarity for DIO5.</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO5_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO5_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO5_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO5_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY15_0_DIO6</name>
                            <description>Enables and configures edge detection polarity for DIO6.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO6_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO6_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO6_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO6_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY15_0_DIO7</name>
                            <description>Enables and configures edge detection polarity for DIO7.</description>
                            <bitOffset>0xE</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO7_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO7_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO7_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO7_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY15_0_DIO8</name>
                            <description>Enables and configures edge detection polarity for DIO8.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO8_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO8_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO8_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO8_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY15_0_DIO9</name>
                            <description>Enables and configures edge detection polarity for DIO9.</description>
                            <bitOffset>0x12</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO9_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO9_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO9_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO9_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY15_0_DIO10</name>
                            <description>Enables and configures edge detection polarity for DIO10.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO10_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO10_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO10_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO10_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY15_0_DIO11</name>
                            <description>Enables and configures edge detection polarity for DIO11.</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO11_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO11_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO11_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO11_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY15_0_DIO12</name>
                            <description>Enables and configures edge detection polarity for DIO12.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO12_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO12_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO12_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO12_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY15_0_DIO13</name>
                            <description>Enables and configures edge detection polarity for DIO13.</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO13_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO13_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO13_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY15_0_DIO13_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
