fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN28_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN28_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN28_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN28_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN31_16_DIN29</name>
                            <description>Programmable counter length of digital glitch filter for DIN29</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN29_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN29_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN29_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN29_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN31_16_DIN30</name>
                            <description>Programmable counter length of digital glitch filter for DIN30</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN30_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN30_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN30_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN30_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FILTEREN31_16_DIN31</name>
                            <description>Programmable counter length of digital glitch filter for DIN31</description>
                            <bitOffset>0x1E</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN31_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN31_ONE_CYCLE</name>
                                    <description>ONE_CYCLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN31_THREE_CYCLE</name>
                                    <description>THREE_CYCLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTEREN31_16_DIN31_EIGHT_CYCLE</name>
                                    <description>EIGHT_CYCLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
