fullyautomated/mspm0-svd/svd/mspm0c110x.svd
Note: The repeat-single (2h) and repeat-block (3h) transfer are only available in a FULL-channel configuration. Please consult the datasheet of the specific device to map which channel number has FULL or BASIC capability. In a BASIC channel configuration only the values for single (0h) and block (1h) transfer can be set.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DMACTL_DMATM_SINGLE</name>
                                    <description>SINGLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMATM_BLOCK</name>
                                    <description>BLOCK</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMATM_RPTSNGL</name>
                                    <description>RPTSNGL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMATM_RPTBLCK</name>
                                    <description>RPTBLCK</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMACTL_DMAEM</name>
                            <description>DMA extended mode

Note: The extended transfer modes are only available in a FULL-channel configuration. Please consult the datasheet of the specific device to map which channel number has FULL or BASIC capability. In a BASIC channel configuration this register is a read-only register and reads 0x0.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DMACTL_DMAEM_NORMAL</name>
                                    <description>NORMAL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMAEM_FILLMODE</name>
                                    <description>FILLMODE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMAEM_TABLEMODE</name>
                                    <description>TABLEMODE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMACTL_DMAPREIRQ</name>
                            <description>Enable an early IRQ event. This can help software to react quicker to and DMA done event or allows some additional configuration before the channel is complete. 

Note: This register is only available in a FULL-channel configuration. Please consult the datasheet of the specific device to map which channel number has FULL or BASIC capability. In a BASIC configuration this register is a read only value and always reads as 0x0.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DMACTL_DMAPREIRQ_PREIRQ_DISABLE</name>
                                    <description>PREIRQ_DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMAPREIRQ_PREIRQ_1</name>
                                    <description>PREIRQ_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMAPREIRQ_PREIRQ_2</name>
                                    <description>PREIRQ_2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMAPREIRQ_PREIRQ_4</name>
                                    <description>PREIRQ_4</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMAPREIRQ_PREIRQ_8</name>
                                    <description>PREIRQ_8</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMAPREIRQ_PREIRQ_32</name>
                                    <description>PREIRQ_32</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMAPREIRQ_PREIRQ_64</name>
                                    <description>PREIRQ_64</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DMACTL_DMAPREIRQ_PREIRQ_HALF</name>
                                    <description>PREIRQ_HALF</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMASA</name>
                    <description>DMA Channel Source Address</description>
                    <addressOffset>0x1204</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DMASA_ADDR</name>
                            <description>DMA Channel Source Address</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMADA</name>
                    <description>DMA Channel Destination Address</description>
                    <addressOffset>0x1208</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DMADA_ADDR</name>
                            <description>DMA Channel Destination Address</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMASZ</name>
                    <description>DMA Channel Size</description>
                    <addressOffset>0x120C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DMASZ_SIZE</name>
                            <description>DMA Channel Size in number of transfers</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                        </field>
                    </fields>
                </register>
