fullyautomated/mspm0-svd/svd/mspm0c110x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CPUSS</name>
            <version>1.0</version>
            <description>CPUSSMMR</description>
            <baseAddress>0x40400000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1F00</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>EVT_MODE</name>
                    <description>Event Mode</description>
                    <addressOffset>0x10E0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>EVT_MODE_INT_CFG</name>
                            <description>Event line mode select</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT_CFG_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT_CFG_SOFTWARE</name>
                                    <description>SOFTWARE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVT_MODE_INT_CFG_HARDWARE</name>
                                    <description>HARDWARE</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DESC</name>
                    <description>Module Description</description>
                    <addressOffset>0x10FC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>DESC_MINREV</name>
                            <description>Minor rev of the IP</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DESC_MAJREV</name>
                            <description>Major rev of the IP</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DESC_FEATUREVER</name>
                            <description>Feature Set for the module *instance*</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DESC_MODULEID</name>
                            <description>Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IIDX</name>
                    <description>Interrupt index</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IIDX_STAT</name>
                            <description>Interrupt index status</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IIDX_STAT_NO_INTR</name>
                                    <description>NO_INTR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_INT0</name>
                                    <description>INT0</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_INT1</name>
                                    <description>INT1</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_INT2</name>
                                    <description>INT2</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_INT3</name>
                                    <description>INT3</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_INT4</name>
                                    <description>INT4</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_INT5</name>
                                    <description>INT5</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_INT6</name>
                                    <description>INT6</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IIDX_STAT_INT7</name>
                                    <description>INT7</description>
                                    <value>8</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IMASK</name>
                    <description>Interrupt mask</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x000000ff</resetValue>
                    <fields>
                        <field>
                            <name>IMASK_INT</name>
                            <description>Masks the corresponding interrupt</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IMASK_INT_INT0</name>
                                    <description>INT0</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IMASK_INT_INT1</name>
                                    <description>INT1</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IMASK_INT_INT2</name>
                                    <description>INT2</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IMASK_INT_INT3</name>
                                    <description>INT3</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IMASK_INT_INT4</name>
                                    <description>INT4</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IMASK_INT_INT5</name>
                                    <description>INT5</description>
                                    <value>32</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IMASK_INT_INT6</name>
                                    <description>INT6</description>
                                    <value>64</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IMASK_INT_INT7</name>
                                    <description>INT7</description>
                                    <value>128</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RIS</name>
                    <description>Raw interrupt status</description>
                    <addressOffset>0x1110</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RIS_INT</name>
                            <description>Raw interrupt status for INT</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RIS_INT_INT0</name>
                                    <description>INT0</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RIS_INT_INT1</name>
                                    <description>INT1</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RIS_INT_INT2</name>
                                    <description>INT2</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RIS_INT_INT3</name>
                                    <description>INT3</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RIS_INT_INT4</name>
                                    <description>INT4</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RIS_INT_INT5</name>
                                    <description>INT5</description>
                                    <value>32</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RIS_INT_INT6</name>
                                    <description>INT6</description>
                                    <value>64</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RIS_INT_INT7</name>
                                    <description>INT7</description>
                                    <value>128</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MIS</name>
                    <description>Masked interrupt status</description>
                    <addressOffset>0x1118</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MIS_INT</name>
                            <description>Masked interrupt status for INT0</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MIS_INT_INT0</name>
                                    <description>INT0</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MIS_INT_INT1</name>
                                    <description>INT1</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MIS_INT_INT2</name>
                                    <description>INT2</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MIS_INT_INT3</name>
                                    <description>INT3</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MIS_INT_INT4</name>
                                    <description>INT4</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MIS_INT_INT5</name>
                                    <description>INT5</description>
                                    <value>32</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MIS_INT_INT6</name>
                                    <description>INT6</description>
                                    <value>64</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MIS_INT_INT7</name>
                                    <description>INT7</description>
                                    <value>128</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISET</name>
                    <description>Interrupt set</description>
                    <addressOffset>0x1120</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ISET_INT</name>
                            <description>Sets INT in RIS register</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ISET_INT_INT0</name>
                                    <description>INT0</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_INT_INT1</name>
                                    <description>INT1</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_INT_INT2</name>
                                    <description>INT2</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_INT_INT3</name>
                                    <description>INT3</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_INT_INT4</name>
                                    <description>INT4</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_INT_INT5</name>
                                    <description>INT5</description>
                                    <value>32</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_INT_INT6</name>
                                    <description>INT6</description>
                                    <value>64</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_INT_INT7</name>
                                    <description>INT7</description>
                                    <value>128</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICLR</name>
                    <description>Interrupt clear</description>
                    <addressOffset>0x1128</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ICLR_INT</name>
                            <description>Clears INT in RIS register</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ICLR_INT_INT0</name>
                                    <description>INT0</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_INT_INT1</name>
                                    <description>INT1</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_INT_INT2</name>
                                    <description>INT2</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_INT_INT3</name>
                                    <description>INT3</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_INT_INT4</name>
                                    <description>INT4</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_INT_INT5</name>
                                    <description>INT5</description>
                                    <value>32</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_INT_INT6</name>
                                    <description>INT6</description>
                                    <value>64</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_INT_INT7</name>
                                    <description>INT7</description>
                                    <value>128</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
