fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <name>INT_EVENT0_IIDX</name>
                    <description>Interrupt index</description>
                    <addressOffset>0x1020</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT0_IIDX_STAT</name>
                            <description>Interrupt index status</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0xA</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_NO_INTR</name>
                                    <description>NO_INTR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_OVIFG</name>
                                    <description>OVIFG</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_TOVIFG</name>
                                    <description>TOVIFG</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_HIGHIFG</name>
                                    <description>HIGHIFG</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_LOWIFG</name>
                                    <description>LOWIFG</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_INIFG</name>
                                    <description>INIFG</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_DMADONE</name>
                                    <description>DMADONE</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_UVIFG</name>
                                    <description>UVIFG</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG0</name>
                                    <description>MEMRESIFG0</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG1</name>
                                    <description>MEMRESIFG1</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG2</name>
                                    <description>MEMRESIFG2</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG3</name>
                                    <description>MEMRESIFG3</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG4</name>
                                    <description>MEMRESIFG4</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG5</name>
                                    <description>MEMRESIFG5</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG6</name>
                                    <description>MEMRESIFG6</description>
                                    <value>15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG7</name>
                                    <description>MEMRESIFG7</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG8</name>
                                    <description>MEMRESIFG8</description>
                                    <value>17</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG9</name>
                                    <description>MEMRESIFG9</description>
                                    <value>18</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG10</name>
                                    <description>MEMRESIFG10</description>
                                    <value>19</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG11</name>
                                    <description>MEMRESIFG11</description>
                                    <value>20</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG12</name>
                                    <description>MEMRESIFG12</description>
                                    <value>21</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG13</name>
                                    <description>MEMRESIFG13</description>
                                    <value>22</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG14</name>
                                    <description>MEMRESIFG14</description>
                                    <value>23</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG15</name>
                                    <description>MEMRESIFG15</description>
                                    <value>24</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG16</name>
                                    <description>MEMRESIFG16</description>
                                    <value>25</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG17</name>
                                    <description>MEMRESIFG17</description>
                                    <value>26</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG18</name>
                                    <description>MEMRESIFG18</description>
                                    <value>27</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG19</name>
                                    <description>MEMRESIFG19</description>
                                    <value>28</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG20</name>
                                    <description>MEMRESIFG20</description>
                                    <value>29</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG21</name>
                                    <description>MEMRESIFG21</description>
                                    <value>30</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG22</name>
                                    <description>MEMRESIFG22</description>
                                    <value>31</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IIDX_STAT_MEMRESIFG23</name>
                                    <description>MEMRESIFG23</description>
                                    <value>32</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_EVENT0_IMASK</name>
                    <description>Interrupt mask</description>
                    <addressOffset>0x1028</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT0_IMASK_INIFG</name>
                            <description>Mask INIFG in MIS_EX register.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_INIFG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_INIFG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_IMASK_LOWIFG</name>
                            <description>Raw interrupt flag for the MEMRESx result register being below
than the WCLOWx threshold of the window comparator.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_LOWIFG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_LOWIFG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_IMASK_HIGHIFG</name>
                            <description>Raw interrupt flag for the MEMRESx result register being higher
than the WCHIGHx threshold of the window comparator.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_HIGHIFG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_HIGHIFG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_IMASK_OVIFG</name>
                            <description>Raw interrupt flag for MEMRESx overflow.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_OVIFG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_OVIFG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_IMASK_UVIFG</name>
                            <description>Raw interrupt flag for MEMRESx underflow.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR is set to 1.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_UVIFG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_UVIFG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_IMASK_TOVIFG</name>
                            <description>Raw interrupt flag for sequence conversion timeout overflow.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_TOVIFG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_TOVIFG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_IMASK_DMADONE</name>
                            <description>Raw interrupt flag for DMADONE. 
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_DMADONE_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_DMADONE_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_IMASK_MEMRESIFG0</name>
                            <description>Raw interrupt status for MEMRES0.
This bit is set to 1 when MEMRES0 is loaded with a new
conversion result.
Reading MEMRES0 register will clear this bit, or when the
corresponding bit in ICLR is set to 1</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_MEMRESIFG0_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_MEMRESIFG0_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_IMASK_MEMRESIFG1</name>
                            <description>Raw interrupt status for MEMRES1.
This bit is set to 1 when MEMRES1 is loaded with a new
conversion result.
Reading MEMRES1 register will clear this bit, or when the
corresponding bit in ICLR is set to 1</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_MEMRESIFG1_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_MEMRESIFG1_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_IMASK_MEMRESIFG2</name>
                            <description>Raw interrupt status for MEMRES2.
This bit is set to 1 when MEMRES2 is loaded with a new
conversion result.
Reading MEMRES2 register will clear this bit, or when the
corresponding bit in ICLR is set to 1</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_MEMRESIFG2_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_MEMRESIFG2_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_IMASK_MEMRESIFG3</name>
                            <description>Raw interrupt status for MEMRES3.
This bit is set to 1 when MEMRES3 is loaded with a new
conversion result.
Reading MEMRES3 register will clear this bit, or when the
corresponding bit in ICLR is set to 1</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_MEMRESIFG3_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_IMASK_MEMRESIFG3_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
