fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <name>INT_EVENT0_MIS</name>
                    <description>Masked interrupt status</description>
                    <addressOffset>0x1038</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INT_EVENT0_MIS_INIFG</name>
                            <description>Mask INIFG in MIS_EX register.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_INIFG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_INIFG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_LOWIFG</name>
                            <description>Raw interrupt flag for the MEMRESx result register being below
than the WCLOWx threshold of the window comparator.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_LOWIFG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_LOWIFG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_HIGHIFG</name>
                            <description>Raw interrupt flag for the MEMRESx result register being higher
than the WCHIGHx threshold of the window comparator.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_HIGHIFG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_HIGHIFG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_OVIFG</name>
                            <description>Raw interrupt flag for MEMRESx overflow.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_OVIFG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_OVIFG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_UVIFG</name>
                            <description>Raw interrupt flag for MEMRESx underflow.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR is set to 1.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_UVIFG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_UVIFG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_TOVIFG</name>
                            <description>Raw interrupt flag for sequence conversion timeout overflow.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_TOVIFG_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_TOVIFG_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_DMADONE</name>
                            <description>Raw interrupt flag for DMADONE. 
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DMADONE_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_DMADONE_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_MEMRESIFG0</name>
                            <description>Raw interrupt status for MEMRES0.
This bit is set to 1 when MEMRES0 is loaded with a new
conversion result.
Reading MEMRES0 register will clear this bit, or when the
corresponding bit in ICLR is set to 1</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_MEMRESIFG0_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_MEMRESIFG0_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_MEMRESIFG1</name>
                            <description>Raw interrupt status for MEMRES1.
This bit is set to 1 when MEMRES1 is loaded with a new
conversion result.
Reading MEMRES1 register will clear this bit, or when the
corresponding bit in ICLR is set to 1</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_MEMRESIFG1_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_MEMRESIFG1_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_MEMRESIFG2</name>
                            <description>Raw interrupt status for MEMRES2.
This bit is set to 1 when MEMRES2 is loaded with a new
conversion result.
Reading MEMRES2 register will clear this bit, or when the
corresponding bit in ICLR is set to 1</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_MEMRESIFG2_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_MEMRESIFG2_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INT_EVENT0_MIS_MEMRESIFG3</name>
                            <description>Raw interrupt status for MEMRES3.
This bit is set to 1 when MEMRES3 is loaded with a new
conversion result.
Reading MEMRES3 register will clear this bit, or when the
corresponding bit in ICLR is set to 1</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_MEMRESIFG3_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INT_EVENT0_MIS_MEMRESIFG3_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
