fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <name>CCPD</name>
                    <description>CCP Direction</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CCPD_C0CCP0</name>
                            <description>Counter CCP0</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCPD_C0CCP0_INPUT</name>
                                    <description>INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCPD_C0CCP0_OUTPUT</name>
                                    <description>OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCPD_C0CCP1</name>
                            <description>Counter CCP1</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCPD_C0CCP1_INPUT</name>
                                    <description>INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCPD_C0CCP1_OUTPUT</name>
                                    <description>OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCPD_C0CCP2</name>
                            <description>Counter CCP2</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCPD_C0CCP2_INPUT</name>
                                    <description>INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCPD_C0CCP2_OUTPUT</name>
                                    <description>OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCPD_C0CCP3</name>
                            <description>Counter CCP3</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCPD_C0CCP3_INPUT</name>
                                    <description>INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCPD_C0CCP3_OUTPUT</name>
                                    <description>OUTPUT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ODIS</name>
                    <description>Output Disable</description>
                    <addressOffset>0x1104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>ODIS_C0CCP0</name>
                            <description>Counter CCP0 Disable Mask
Defines whether CCP0 of Counter n is forced low or not</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ODIS_C0CCP0_CCP_OUTPUT_OCTL</name>
                                    <description>CCP_OUTPUT_OCTL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ODIS_C0CCP0_CCP_OUTPUT_LOW</name>
                                    <description>CCP_OUTPUT_LOW</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ODIS_C0CCP1</name>
                            <description>Counter CCP1 Disable Mask
Defines whether CCP0 of Counter n is forced low or not</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ODIS_C0CCP1_CCP_OUTPUT_OCTL</name>
                                    <description>CCP_OUTPUT_OCTL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ODIS_C0CCP1_CCP_OUTPUT_LOW</name>
                                    <description>CCP_OUTPUT_LOW</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ODIS_C0CCP2</name>
                            <description>Counter CCP2 Disable Mask
Defines whether CCP2 of Counter n is forced low or not</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ODIS_C0CCP2_CCP_OUTPUT_OCTL</name>
                                    <description>CCP_OUTPUT_OCTL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ODIS_C0CCP2_CCP_OUTPUT_LOW</name>
                                    <description>CCP_OUTPUT_LOW</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ODIS_C0CCP3</name>
                            <description>Counter CCP3 Disable Mask
Defines whether CCP3 of Counter n is forced low or not</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ODIS_C0CCP3_CCP_OUTPUT_OCTL</name>
                                    <description>CCP_OUTPUT_OCTL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ODIS_C0CCP3_CCP_OUTPUT_LOW</name>
                                    <description>CCP_OUTPUT_LOW</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCLKCTL</name>
                    <description>Counter Clock Control Register</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CCLKCTL_CLKEN</name>
                            <description>Clock Enable
Disables the clock gating to the module. SW has to explicitly program the value
 to 0 to gate the clock.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCLKCTL_CLKEN_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCLKCTL_CLKEN_ENABLED</name>
                                    <description>ENABLED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPS</name>
                    <description>Clock Prescale Register</description>
                    <addressOffset>0x110C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CPS_PCNT</name>
                            <description>Pre-Scale Count
This field specifies the pre-scale count value.  The selected TIMCLK source is divided by a value of (PCNT+1). 
A PCNT value of 0 divides TIMCLK by 1, effectively bypassing the divider.
A PCNT value of greater than 0 divides the TIMCLK source generating a slower clock</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPSV</name>
                    <description>Clock prescale count status register</description>
                    <addressOffset>0x1110</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>CPSV_CPSVAL</name>
                            <description>Current Prescale Count Value</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTTRIGCTL</name>
                    <description>Timer Cross Trigger Control Register</description>
                    <addressOffset>0x1114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CTTRIGCTL_CTEN</name>
                            <description>Timer Cross trigger enable. This field is used to enable whether the SW or HW logic can generate a timer cross trigger event in the system.
These cross triggers are connected to the respective timer trigger in of the other timer IPs in the SOC power domain.

The timer cross trigger is essentially the combined logic of the HW and SW conditions controlling EN bit in the CTRCTL register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTTRIGCTL_CTEN_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTTRIGCTL_CTEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTTRIGCTL_EVTCTEN</name>
                            <description>Enable the Input Trigger Conditions to the Timer module as a condition for Cross Triggers. Refer  Figure 8 Cross Trigger Generation Path</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTTRIGCTL_EVTCTEN_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTTRIGCTL_EVTCTEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTTRIGCTL_EVTCTTRIGSEL</name>
                            <description>Used to Select the subscriber port that should be used for input cross trigger. Refer  Figure 8 Cross Trigger Generation Path</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTTRIGCTL_EVTCTTRIGSEL_FSUB0</name>
                                    <description>FSUB0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTTRIGCTL_EVTCTTRIGSEL_FSUB1</name>
                                    <description>FSUB1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTTRIGCTL_EVTCTTRIGSEL_Z</name>
                                    <description>Z</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTTRIGCTL_EVTCTTRIGSEL_L</name>
                                    <description>L</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTTRIGCTL_EVTCTTRIGSEL_CCD0</name>
                                    <description>CCD0</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTTRIGCTL_EVTCTTRIGSEL_CCD1</name>
                                    <description>CCD1</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTTRIGCTL_EVTCTTRIGSEL_CCD2</name>
                                    <description>CCD2</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTTRIGCTL_EVTCTTRIGSEL_CCD3</name>
                                    <description>CCD3</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTTRIGCTL_EVTCTTRIGSEL_CCU0</name>
                                    <description>CCU0</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTTRIGCTL_EVTCTTRIGSEL_CCU1</name>
                                    <description>CCU1</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTTRIGCTL_EVTCTTRIGSEL_CCU2</name>
                                    <description>CCU2</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTTRIGCTL_EVTCTTRIGSEL_CCU3</name>
                                    <description>CCU3</description>
                                    <value>11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTTRIG</name>
                    <description>Timer Cross Trigger Register</description>
                    <addressOffset>0x111C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <fields>
                        <field>
                            <name>CTTRIG_TRIG</name>
                            <description>Generate Cross Trigger
This bit when programmed will generate a synchronized trigger condition all the cross trigger enabled Timer instances including current timer instance.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTTRIG_TRIG_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTTRIG_TRIG_GENERATE</name>
                                    <description>GENERATE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
