fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <dim>2</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1</dimArrayIndex>
                    <name>CCCTL_45[%s]</name>
                    <description>Capture or Compare Control Registers</description>
                    <addressOffset>0x1840</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CCCTL_45_SCERCNEZ</name>
                            <description>Suppress Compare Event if Repeat Counter is Not Equal to Zero
This bit suppresses the generation of the compare (CCD, CCU and RC) events from
the counter when the repeat counter (RC) value is not 0.</description>
                            <bitOffset>0x19</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCCTL_45_SCERCNEZ_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_45_SCERCNEZ_ENABLED</name>
                                    <description>ENABLED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCCTL_45_CCUPD</name>
                            <description>Capture and Compare Update Method
This field controls how updates to the pipelined
capture and compare register are performed
(when operating in compare mode, COC=0).</description>
                            <bitOffset>0x12</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCCTL_45_CCUPD_IMMEDIATELY</name>
                                    <description>IMMEDIATELY</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_45_CCUPD_ZERO_EVT</name>
                                    <description>ZERO_EVT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_45_CCUPD_COMPARE_DOWN_EVT</name>
                                    <description>COMPARE_DOWN_EVT</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_45_CCUPD_COMPARE_UP_EVT</name>
                                    <description>COMPARE_UP_EVT</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_45_CCUPD_ZERO_LOAD_EVT</name>
                                    <description>ZERO_LOAD_EVT</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_45_CCUPD_ZERO_RC_ZERO_EVT</name>
                                    <description>ZERO_RC_ZERO_EVT</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_45_CCUPD_TRIG</name>
                                    <description>TRIG</description>
                                    <value>6</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1</dimArrayIndex>
                    <name>OCTL_01[%s]</name>
                    <description>CCP Output Control Registers</description>
                    <addressOffset>0x1850</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>OCTL_01_CCPOINV</name>
                            <description>CCP Output Invert The output as selected by CCPO is conditionally inverted.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPOINV_NOINV</name>
                                    <description>NOINV</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPOINV_INV</name>
                                    <description>INV</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OCTL_01_CCPIV</name>
                            <description>CCP Initial Value This bit specifies the logical value put on the signal generator state while the counter is disabled (CTRCTL.EN == 0).</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPIV_LOW</name>
                                    <description>LOW</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPIV_HIGH</name>
                                    <description>HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OCTL_01_CCPO</name>
                            <description>CCP Output Source</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_FUNCVAL</name>
                                    <description>FUNCVAL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_LOAD</name>
                                    <description>LOAD</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_CMPVAL</name>
                                    <description>CMPVAL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_ZERO</name>
                                    <description>ZERO</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_CAPCOND</name>
                                    <description>CAPCOND</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_FAULTCOND</name>
                                    <description>FAULTCOND</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_CC0_MIRROR_ALL</name>
                                    <description>CC0_MIRROR_ALL</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_CC1_MIRROR_ALL</name>
                                    <description>CC1_MIRROR_ALL</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_DEADBAND</name>
                                    <description>DEADBAND</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_CNTDIR</name>
                                    <description>CNTDIR</description>
                                    <value>13</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1</dimArrayIndex>
                    <name>OCTL_23[%s]</name>
                    <description>CCP Output Control Registers</description>
                    <addressOffset>0x1858</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>OCTL_23_CCPOINV</name>
                            <description>CCP Output Invert The output as selected by CCPO is conditionally inverted.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OCTL_23_CCPOINV_NOINV</name>
                                    <description>NOINV</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_23_CCPOINV_INV</name>
                                    <description>INV</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OCTL_23_CCPIV</name>
                            <description>CCP Initial Value This bit specifies the logical value put on the signal generator state while the counter is disabled (CTRCTL.EN == 0).</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OCTL_23_CCPIV_LOW</name>
                                    <description>LOW</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_23_CCPIV_HIGH</name>
                                    <description>HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OCTL_23_CCPO</name>
                            <description>CCP Output Source</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OCTL_23_CCPO_FUNCVAL</name>
                                    <description>FUNCVAL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_23_CCPO_LOAD</name>
                                    <description>LOAD</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_23_CCPO_CMPVAL</name>
                                    <description>CMPVAL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_23_CCPO_ZERO</name>
                                    <description>ZERO</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_23_CCPO_CAPCOND</name>
                                    <description>CAPCOND</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_23_CCPO_FAULTCOND</name>
                                    <description>FAULTCOND</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_23_CCPO_CC0_MIRROR_ALL</name>
                                    <description>CC0_MIRROR_ALL</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_23_CCPO_CC1_MIRROR_ALL</name>
                                    <description>CC1_MIRROR_ALL</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_23_CCPO_DEADBAND</name>
                                    <description>DEADBAND</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_23_CCPO_CNTDIR</name>
                                    <description>CNTDIR</description>
                                    <value>13</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
