fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <dim>2</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1</dimArrayIndex>
                    <name>CCACT_01[%s]</name>
                    <description>Capture or Compare Action Registers</description>
                    <addressOffset>0x1870</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CCACT_01_ZACT</name>
                            <description>CCP Output Action on Zero  Specifies what changes occur to CCP output as the result of a zero event.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_01_ZACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_ZACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_ZACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_ZACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_01_LACT</name>
                            <description>CCP Output Action on Load  Specifies what changes occur to CCP output as the result of a load event.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_01_LACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_LACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_LACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_LACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_01_CDACT</name>
                            <description>CCP Output Action on Compare (Down)  This field describes the resulting action of the signal generator upon detecting a compare event while counting down.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_01_CDACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CDACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CDACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CDACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_01_CUACT</name>
                            <description>CCP Output Action on Compare (Up)  This field describes the resulting action of the signal generator upon detecting a compare event while counting up.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_01_CUACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CUACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CUACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CUACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_01_CC2DACT</name>
                            <description>CCP Output Action on CC2D event.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_01_CC2DACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CC2DACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CC2DACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CC2DACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_01_CC2UACT</name>
                            <description>CCP Output Action on CC2U event.</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_01_CC2UACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CC2UACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CC2UACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_CC2UACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_01_FENACT</name>
                            <description>CCP Output Action on Fault Entry
This field describes the resulting action of the signal generator upon detecting a fault.</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_01_FENACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_FENACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_FENACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_FENACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_FENACT_CCP_HIGHZ</name>
                                    <description>CCP_HIGHZ</description>
                                    <value>4</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_01_FEXACT</name>
                            <description>CCP Output Action on Fault Exit
This field describes the resulting action of the signal generator upon exiting the fault condition.</description>
                            <bitOffset>0x19</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_01_FEXACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_FEXACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_FEXACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_FEXACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_FEXACT_CCP_HIGHZ</name>
                                    <description>CCP_HIGHZ</description>
                                    <value>4</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_01_SWFRCACT</name>
                            <description>CCP Output Action on Software Force Output

This field describes the resulting action of software force.

This action has a shadow register, which will be updated under specific condition. 
So that this register cannot take into effect immediately.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_01_SWFRCACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_SWFRCACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_SWFRCACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_01_SWFRCACT_CMPL</name>
                            <description>CCP_CMPL Output Action on Software Force Output

This field describes the resulting action of software force.

This action has a shadow register, which will be updated under specific condition. 
So that this register cannot take into effect immediately.</description>
                            <bitOffset>0x1E</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_01_SWFRCACT_CMPL_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_SWFRCACT_CMPL_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_01_SWFRCACT_CMPL_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
