fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <dim>2</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1</dimArrayIndex>
                    <name>IFCTL_01[%s]</name>
                    <description>Input Filter Control Register</description>
                    <addressOffset>0x1880</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>IFCTL_01_ISEL</name>
                            <description>Input Select (CCP0)  This field selects the input source to the filter input. 4h-7h = Reserved</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_CCPX_INPUT</name>
                                    <description>CCPX_INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_CCPX_INPUT_PAIR</name>
                                    <description>CCPX_INPUT_PAIR</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_CCP0_INPUT</name>
                                    <description>CCP0_INPUT</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_TRIG_INPUT</name>
                                    <description>TRIG_INPUT</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_CCP_XOR</name>
                                    <description>CCP_XOR</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_FSUB0</name>
                                    <description>FSUB0</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_FSUB1</name>
                                    <description>FSUB1</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_COMP0</name>
                                    <description>COMP0</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_COMP1</name>
                                    <description>COMP1</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_COMP2</name>
                                    <description>COMP2</description>
                                    <value>9</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IFCTL_01_INV</name>
                            <description>Input Inversion This bit controls whether the selected input is inverted.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IFCTL_01_INV_NOINVERT</name>
                                    <description>NOINVERT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_INV_INVERT</name>
                                    <description>INVERT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IFCTL_01_FP</name>
                            <description>Filter Period. This field specifies the sample period for the
input filter. I.e. The input is sampled for FP
timer clocks during filtering.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IFCTL_01_FP__3</name>
                                    <description>_3</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_FP__5</name>
                                    <description>_5</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_FP__8</name>
                                    <description>_8</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IFCTL_01_CPV</name>
                            <description>Consecutive Period/Voting Select

This bit controls whether the input filter uses a
stricter consecutive period count or majority
voting.</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IFCTL_01_CPV_CONSECUTIVE</name>
                                    <description>CONSECUTIVE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_CPV_VOTING</name>
                                    <description>VOTING</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IFCTL_01_FE</name>
                            <description>Filter Enable
This bit controls whether the input is filtered by
the input filter or bypasses to the edge
detect.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IFCTL_01_FE_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_FE_ENABLED</name>
                                    <description>ENABLED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1</dimArrayIndex>
                    <name>IFCTL_23[%s]</name>
                    <description>Input Filter Control Register</description>
                    <addressOffset>0x1888</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>IFCTL_23_ISEL</name>
                            <description>Input Select (CCP0)  This field selects the input source to the filter input. 4h-7h = Reserved</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IFCTL_23_ISEL_CCPX_INPUT</name>
                                    <description>CCPX_INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_23_ISEL_CCPX_INPUT_PAIR</name>
                                    <description>CCPX_INPUT_PAIR</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_23_ISEL_CCP0_INPUT</name>
                                    <description>CCP0_INPUT</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_23_ISEL_TRIG_INPUT</name>
                                    <description>TRIG_INPUT</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_23_ISEL_CCP_XOR</name>
                                    <description>CCP_XOR</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_23_ISEL_FSUB0</name>
                                    <description>FSUB0</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_23_ISEL_FSUB1</name>
                                    <description>FSUB1</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_23_ISEL_COMP0</name>
                                    <description>COMP0</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_23_ISEL_COMP1</name>
                                    <description>COMP1</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_23_ISEL_COMP2</name>
                                    <description>COMP2</description>
                                    <value>9</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IFCTL_23_INV</name>
                            <description>Input Inversion This bit controls whether the selected input is inverted.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IFCTL_23_INV_NOINVERT</name>
                                    <description>NOINVERT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_23_INV_INVERT</name>
                                    <description>INVERT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IFCTL_23_FP</name>
                            <description>Filter Period. This field specifies the sample period for the
input filter. I.e. The input is sampled for FP
timer clocks during filtering.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IFCTL_23_FP__3</name>
                                    <description>_3</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_23_FP__5</name>
                                    <description>_5</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_23_FP__8</name>
                                    <description>_8</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IFCTL_23_CPV</name>
                            <description>Consecutive Period/Voting Select

This bit controls whether the input filter uses a
stricter consecutive period count or majority
voting.</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IFCTL_23_CPV_CONSECUTIVE</name>
                                    <description>CONSECUTIVE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_23_CPV_VOTING</name>
                                    <description>VOTING</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IFCTL_23_FE</name>
                            <description>Filter Enable
This bit controls whether the input is filtered by
the input filter or bypasses to the edge
detect.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IFCTL_23_FE_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_23_FE_ENABLED</name>
                                    <description>ENABLED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PL</name>
                    <description>Counter Register</description>
                    <addressOffset>0x18A0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PL_PHASE</name>
                            <description>Phase Load value</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DBCTL</name>
                    <description>Dead Band insertion control register</description>
                    <addressOffset>0x18A4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DBCTL_RISEDELAY</name>
                            <description>Rise Delay
The number of TIMCLK periods inserted between the fall of CCPi and the rise of CCPAo.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0xC</bitWidth>
                        </field>
                        <field>
                            <name>DBCTL_FALLDELAY</name>
                            <description>Fall Delay
The number of TIMCLK periods inserted between the fall of CCPi and the rise of CCPBo</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0xC</bitWidth>
                        </field>
                        <field>
                            <name>DBCTL_M1_ENABLE</name>
                            <description>Dead Band Mode 1 Enable.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DBCTL_M1_ENABLE_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DBCTL_M1_ENABLE_ENABLED</name>
                                    <description>ENABLED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
