fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <name>TSEL</name>
                    <description>Trigger Select</description>
                    <addressOffset>0x18B0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TSEL_ETSEL</name>
                            <description>External Trigger Select. #br# This selects which System Event is used if the input filter selects trigger.  
Triggers 0-15 are used to connect triggers generated by other timer modules in the same power domain. Refer to the SoC datasheet to get details.
Triggers 16 and  17 are connected to event manager subscriber ports.
Event lines 18-31 are reserved for future use.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG0</name>
                                    <description>TRIG0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG1</name>
                                    <description>TRIG1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG2</name>
                                    <description>TRIG2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG3</name>
                                    <description>TRIG3</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG4</name>
                                    <description>TRIG4</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG5</name>
                                    <description>TRIG5</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG6</name>
                                    <description>TRIG6</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG7</name>
                                    <description>TRIG7</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG8</name>
                                    <description>TRIG8</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG9</name>
                                    <description>TRIG9</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG10</name>
                                    <description>TRIG10</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG11</name>
                                    <description>TRIG11</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG12</name>
                                    <description>TRIG12</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG13</name>
                                    <description>TRIG13</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG14</name>
                                    <description>TRIG14</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG15</name>
                                    <description>TRIG15</description>
                                    <value>15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG_SUB0</name>
                                    <description>TRIG_SUB0</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_ETSEL_TRIG_SUB1</name>
                                    <description>TRIG_SUB1</description>
                                    <value>17</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TSEL_TE</name>
                            <description>Trigger Enable.
This selects whether a trigger is enabled or not for this counter  
0x0 = Triggers are not used 
0x1 = Triggers are used as selected by the ETSEL field</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TSEL_TE_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TSEL_TE_ENABLED</name>
                                    <description>ENABLED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RC</name>
                    <description>Repeat counter</description>
                    <addressOffset>0x18B4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RC_RC</name>
                            <description>Repeat Counter Value</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCLD</name>
                    <description>Repeat counter</description>
                    <addressOffset>0x18B8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RCLD_RCLD</name>
                            <description>Repeat Counter Load Value
This field provides the value loaded into the
repeat counter at a load event following the
repeat counter value equaling 0.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCTL</name>
                    <description>Fault Control Register</description>
                    <addressOffset>0x18D0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>FCTL_FIEN</name>
                            <description>Fault Input Enable
This bit enables the input for fault detection.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FCTL_FIEN_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FCTL_FIEN_ENABLED</name>
                                    <description>ENABLED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FCTL_FI</name>
                            <description>Fault Input
Specifies whether the overall fault condition is dependent on the sensed fault pin.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FCTL_FI_INDEPENDENT</name>
                                    <description>INDEPENDENT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FCTL_FI_DEPENDENT</name>
                                    <description>DEPENDENT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FCTL_TFIM</name>
                            <description>Trigger Fault Input Mask
Specifies whether the selected trigger participates as a fault input. If enabled and the trigger asserts, the trigger is treated as a fault.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FCTL_TFIM_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FCTL_TFIM_ENABLED</name>
                                    <description>ENABLED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FCTL_FL</name>
                            <description>Fault Latch mode
Specifies whether the fault condition is latched and configures the latch clear conditions.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FCTL_FL_NO_LATCH</name>
                                    <description>NO_LATCH</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FCTL_FL_LATCH_SW_CLR</name>
                                    <description>LATCH_SW_CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FCTL_FL_LATCH_Z_CLR</name>
                                    <description>LATCH_Z_CLR</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FCTL_FL_LATCH_LD_CLR</name>
                                    <description>LATCH_LD_CLR</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FCTL_FSENAC0</name>
                            <description>Specifies whether the analog comparator0 fault sense is high or low active</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FCTL_FSENAC0_LOWCTIVE</name>
                                    <description>LOWCTIVE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FCTL_FSENAC0_HIGHACTIVE</name>
                                    <description>HIGHACTIVE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FCTL_FSENAC1</name>
                            <description>Specifies whether the analog comparator1 fault sense is high or low active</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FCTL_FSENAC1_LOWCTIVE</name>
                                    <description>LOWCTIVE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FCTL_FSENAC1_HIGHACTIVE</name>
                                    <description>HIGHACTIVE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FCTL_FSENAC2</name>
                            <description>Specifies whether the analog comparator2 fault sense is high or low active</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FCTL_FSENAC2_LOWCTIVE</name>
                                    <description>LOWCTIVE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FCTL_FSENAC2_HIGHACTIVE</name>
                                    <description>HIGHACTIVE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FCTL_FSENEXT0</name>
                            <description>Specifies whether the external fault pin0 sense is high or low active</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FCTL_FSENEXT0_LOWCTIVE</name>
                                    <description>LOWCTIVE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FCTL_FSENEXT0_HIGHACTIVE</name>
                                    <description>HIGHACTIVE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FCTL_FSENEXT1</name>
                            <description>Specifies whether the external fault pin1 fault sense is high or low active</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FCTL_FSENEXT1_LOWCTIVE</name>
                                    <description>LOWCTIVE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FCTL_FSENEXT1_HIGHACTIVE</name>
                                    <description>HIGHACTIVE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FCTL_FSENEXT2</name>
                            <description>Specifies whether the external fault pin3 fault sense is high or low active</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FCTL_FSENEXT2_LOWCTIVE</name>
                                    <description>LOWCTIVE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FCTL_FSENEXT2_HIGHACTIVE</name>
                                    <description>HIGHACTIVE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
