fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <name>ISET</name>
                    <description>Interrupt set</description>
                    <addressOffset>0x1040</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ISET_Z</name>
                            <description>Zero event SET</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ISET_Z_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_Z_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ISET_L</name>
                            <description>Load event SET</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ISET_L_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_L_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ISET_CCD0</name>
                            <description>Capture or compare down event SET</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ISET_CCD0_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_CCD0_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ISET_CCD1</name>
                            <description>Capture or compare down event SET</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ISET_CCD1_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_CCD1_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ISET_CCU0</name>
                            <description>Capture or compare up event SET</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ISET_CCU0_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_CCU0_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ISET_CCU1</name>
                            <description>Capture or compare up event SET</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ISET_CCU1_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_CCU1_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ISET_TOV</name>
                            <description>Trigger Overflow event SET</description>
                            <bitOffset>0x19</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ISET_TOV_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_TOV_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ISET_CCD2</name>
                            <description>Capture or compare down event SET</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ISET_CCD2_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_CCD2_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ISET_CCD3</name>
                            <description>Capture or compare down event SET</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ISET_CCD3_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_CCD3_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ISET_CCU2</name>
                            <description>Capture or compare up event SET</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ISET_CCU2_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_CCU2_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ISET_CCU3</name>
                            <description>Capture or compare up event SET</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ISET_CCU3_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ISET_CCU3_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICLR</name>
                    <description>Interrupt clear</description>
                    <addressOffset>0x1048</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ICLR_Z</name>
                            <description>Zero event CLEAR</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ICLR_Z_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_Z_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICLR_L</name>
                            <description>Load event CLEAR</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ICLR_L_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_L_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICLR_CCD0</name>
                            <description>Capture or compare down event CLEAR</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ICLR_CCD0_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_CCD0_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICLR_CCD1</name>
                            <description>Capture or compare down event CLEAR</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ICLR_CCD1_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_CCD1_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICLR_CCU0</name>
                            <description>Capture or compare up event CLEAR</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ICLR_CCU0_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_CCU0_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICLR_CCU1</name>
                            <description>Capture or compare up event CLEAR</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ICLR_CCU1_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_CCU1_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICLR_TOV</name>
                            <description>Trigger Overflow event CLEAR</description>
                            <bitOffset>0x19</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ICLR_TOV_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_TOV_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICLR_CCD2</name>
                            <description>Capture or compare down event CLEAR</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ICLR_CCD2_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_CCD2_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICLR_CCD3</name>
                            <description>Capture or compare down event CLEAR</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ICLR_CCD3_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_CCD3_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICLR_CCU2</name>
                            <description>Capture or compare up event CLEAR</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ICLR_CCU2_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_CCU2_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ICLR_CCU3</name>
                            <description>Capture or compare up event CLEAR</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ICLR_CCU3_NO_EFFECT</name>
                                    <description>NO_EFFECT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ICLR_CCU3_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
