fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <dim>2</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1</dimArrayIndex>
                    <name>CCCTL_23[%s]</name>
                    <description>Capture or Compare Control Registers</description>
                    <addressOffset>0x1838</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CCCTL_23_CCOND</name>
                            <description>Capture Condition. #br# Specifies the condition that generates a capture pulse. 4h-Fh = Reserved</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCCTL_23_CCOND_NOCAPTURE</name>
                                    <description>NOCAPTURE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CCOND_CC_TRIG_RISE</name>
                                    <description>CC_TRIG_RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CCOND_CC_TRIG_FALL</name>
                                    <description>CC_TRIG_FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CCOND_CC_TRIG_EDGE</name>
                                    <description>CC_TRIG_EDGE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCCTL_23_ACOND</name>
                            <description>Advance Condition. #br# Specifies the condition that generates an advance pulse. 6h-Fh = Reserved</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCCTL_23_ACOND_TIMCLK</name>
                                    <description>TIMCLK</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_ACOND_CC_TRIG_RISE</name>
                                    <description>CC_TRIG_RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_ACOND_CC_TRIG_FALL</name>
                                    <description>CC_TRIG_FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_ACOND_CC_TRIG_EDGE</name>
                                    <description>CC_TRIG_EDGE</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_ACOND_CC_TRIG_HIGH</name>
                                    <description>CC_TRIG_HIGH</description>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCCTL_23_LCOND</name>
                            <description>Load Condition. #br# Specifies the condition that generates a load pulse.  4h-Fh = Reserved</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCCTL_23_LCOND_CC_TRIG_RISE</name>
                                    <description>CC_TRIG_RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_LCOND_CC_TRIG_FALL</name>
                                    <description>CC_TRIG_FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_LCOND_CC_TRIG_EDGE</name>
                                    <description>CC_TRIG_EDGE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCCTL_23_ZCOND</name>
                            <description>Zero Condition. #br# This field specifies the condition that generates a zero pulse. 4h-Fh = Reserved</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCCTL_23_ZCOND_CC_TRIG_RISE</name>
                                    <description>CC_TRIG_RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_ZCOND_CC_TRIG_FALL</name>
                                    <description>CC_TRIG_FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_ZCOND_CC_TRIG_EDGE</name>
                                    <description>CC_TRIG_EDGE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCCTL_23_COC</name>
                            <description>Capture or Compare. #br# Specifies whether the corresponding CC register is used as a capture register or a compare register (never both).</description>
                            <bitOffset>0x11</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCCTL_23_COC_COMPARE</name>
                                    <description>COMPARE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_COC_CAPTURE</name>
                                    <description>CAPTURE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCCTL_23_CCACTUPD</name>
                            <description>CCACT shadow register Update Method
This field controls how updates to the CCCACT shadow register are performed</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCCTL_23_CCACTUPD_IMMEDIATELY</name>
                                    <description>IMMEDIATELY</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CCACTUPD_ZERO_EVT</name>
                                    <description>ZERO_EVT</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CCACTUPD_COMPARE_DOWN_EVT</name>
                                    <description>COMPARE_DOWN_EVT</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CCACTUPD_COMPARE_UP_EVT</name>
                                    <description>COMPARE_UP_EVT</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CCACTUPD_ZERO_LOAD_EVT</name>
                                    <description>ZERO_LOAD_EVT</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CCACTUPD_ZERO_RC_ZERO_EVT</name>
                                    <description>ZERO_RC_ZERO_EVT</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CCACTUPD_TRIG</name>
                                    <description>TRIG</description>
                                    <value>6</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCCTL_23_CC2SELU</name>
                            <description>Selects the source second CCU event.</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCCTL_23_CC2SELU_SEL_CCU0</name>
                                    <description>SEL_CCU0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CC2SELU_SEL_CCU1</name>
                                    <description>SEL_CCU1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CC2SELU_SEL_CCU2</name>
                                    <description>SEL_CCU2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CC2SELU_SEL_CCU3</name>
                                    <description>SEL_CCU3</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CC2SELU_SEL_CCU4</name>
                                    <description>SEL_CCU4</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CC2SELU_SEL_CCU5</name>
                                    <description>SEL_CCU5</description>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCCTL_23_CC2SELD</name>
                            <description>Selects the source second CCD event.</description>
                            <bitOffset>0x1D</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCCTL_23_CC2SELD_SEL_CCD0</name>
                                    <description>SEL_CCD0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CC2SELD_SEL_CCD1</name>
                                    <description>SEL_CCD1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CC2SELD_SEL_CCD2</name>
                                    <description>SEL_CCD2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CC2SELD_SEL_CCD3</name>
                                    <description>SEL_CCD3</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CC2SELD_SEL_CCD4</name>
                                    <description>SEL_CCD4</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCCTL_23_CC2SELD_SEL_CCD5</name>
                                    <description>SEL_CCD5</description>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1</dimArrayIndex>
                    <name>OCTL_01[%s]</name>
                    <description>CCP Output Control Registers</description>
                    <addressOffset>0x1850</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>OCTL_01_CCPOINV</name>
                            <description>CCP Output Invert The output as selected by CCPO is conditionally inverted.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPOINV_NOINV</name>
                                    <description>NOINV</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPOINV_INV</name>
                                    <description>INV</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OCTL_01_CCPIV</name>
                            <description>CCP Initial Value This bit specifies the logical value put on the signal generator state while the counter is disabled (CTRCTL.EN == 0).</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPIV_LOW</name>
                                    <description>LOW</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPIV_HIGH</name>
                                    <description>HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OCTL_01_CCPO</name>
                            <description>CCP Output Source</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_FUNCVAL</name>
                                    <description>FUNCVAL</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_LOAD</name>
                                    <description>LOAD</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_CMPVAL</name>
                                    <description>CMPVAL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_ZERO</name>
                                    <description>ZERO</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_CAPCOND</name>
                                    <description>CAPCOND</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_FAULTCOND</name>
                                    <description>FAULTCOND</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_CC0_MIRROR_ALL</name>
                                    <description>CC0_MIRROR_ALL</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_CC1_MIRROR_ALL</name>
                                    <description>CC1_MIRROR_ALL</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_DEADBAND</name>
                                    <description>DEADBAND</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OCTL_01_CCPO_CNTDIR</name>
                                    <description>CNTDIR</description>
                                    <value>13</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
