fullyautomated/mspm0-svd/svd/mspm0c110x.svd
                <register>
                    <dim>2</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1</dimArrayIndex>
                    <name>CCACT_23[%s]</name>
                    <description>Capture or Compare Action Registers</description>
                    <addressOffset>0x1878</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CCACT_23_ZACT</name>
                            <description>CCP Output Action on Zero  Specifies what changes occur to CCP output as the result of a zero event.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_23_ZACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_ZACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_ZACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_ZACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_23_LACT</name>
                            <description>CCP Output Action on Load  Specifies what changes occur to CCP output as the result of a load event.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_23_LACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_LACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_LACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_LACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_23_CDACT</name>
                            <description>CCP Output Action on Compare (Down)  This field describes the resulting action of the signal generator upon detecting a compare event while counting down.</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_23_CDACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_CDACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_CDACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_CDACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_23_CUACT</name>
                            <description>CCP Output Action on Compare (Up)  This field describes the resulting action of the signal generator upon detecting a compare event while counting up.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_23_CUACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_CUACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_CUACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_CUACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_23_CC2DACT</name>
                            <description>CCP Output Action on CC2D event.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_23_CC2DACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_CC2DACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_CC2DACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_CC2DACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_23_CC2UACT</name>
                            <description>CCP Output Action on CC2U event.</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_23_CC2UACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_CC2UACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_CC2UACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_CC2UACT_CCP_TOGGLE</name>
                                    <description>CCP_TOGGLE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCACT_23_SWFRCACT</name>
                            <description>CCP Output Action on Software Force Output

This field describes the resulting action of software force.

This action has a shadow register, which will be updated under specific condition. 
So that this register cannot take into effect immediately.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CCACT_23_SWFRCACT_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_SWFRCACT_CCP_HIGH</name>
                                    <description>CCP_HIGH</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CCACT_23_SWFRCACT_CCP_LOW</name>
                                    <description>CCP_LOW</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1</dimArrayIndex>
                    <name>IFCTL_01[%s]</name>
                    <description>Input Filter Control Register</description>
                    <addressOffset>0x1880</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>IFCTL_01_ISEL</name>
                            <description>Input Select (CCP0)  This field selects the input source to the filter input. 4h-7h = Reserved</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_CCPX_INPUT</name>
                                    <description>CCPX_INPUT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_CCPX_INPUT_PAIR</name>
                                    <description>CCPX_INPUT_PAIR</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_CCP0_INPUT</name>
                                    <description>CCP0_INPUT</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_TRIG_INPUT</name>
                                    <description>TRIG_INPUT</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_CCP_XOR</name>
                                    <description>CCP_XOR</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_FSUB0</name>
                                    <description>FSUB0</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_FSUB1</name>
                                    <description>FSUB1</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_COMP0</name>
                                    <description>COMP0</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_COMP1</name>
                                    <description>COMP1</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_ISEL_COMP2</name>
                                    <description>COMP2</description>
                                    <value>9</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IFCTL_01_INV</name>
                            <description>Input Inversion This bit controls whether the selected input is inverted.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IFCTL_01_INV_NOINVERT</name>
                                    <description>NOINVERT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_INV_INVERT</name>
                                    <description>INVERT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IFCTL_01_FP</name>
                            <description>Filter Period. This field specifies the sample period for the
input filter. I.e. The input is sampled for FP
timer clocks during filtering.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IFCTL_01_FP__3</name>
                                    <description>_3</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_FP__5</name>
                                    <description>_5</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_FP__8</name>
                                    <description>_8</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IFCTL_01_CPV</name>
                            <description>Consecutive Period/Voting Select

This bit controls whether the input filter uses a
stricter consecutive period count or majority
voting.</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IFCTL_01_CPV_CONSECUTIVE</name>
                                    <description>CONSECUTIVE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_CPV_VOTING</name>
                                    <description>VOTING</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IFCTL_01_FE</name>
                            <description>Filter Enable
This bit controls whether the input is filtered by
the input filter or bypasses to the edge
detect.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IFCTL_01_FE_DISABLED</name>
                                    <description>DISABLED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IFCTL_01_FE_ENABLED</name>
                                    <description>ENABLED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
